<?php

namespace App\ThirdChannel;

use Illuminate\Http\Request;
use Illuminate\Support\Facades\Log;
use Illuminate\Support\Str;
use App\Models\ThirdChannel as ThirdChannelModel;
use App\Models\Transaction;
use Illuminate\Support\Facades\Http;
use Illuminate\Http\Client\ConnectionException;
class HeePay extends ThirdChannel
{
    //Log名称
    public $log_name   = 'HeePay';
    public $type    = 1; //1:代收付 2:纯代收 3:纯代付

    //回调地址
    public $notify    = '';
    public $depositUrl   = '';
    public $xiafaUrl   = 'https://Pay.heepay.com/API/PayTransit/PayTransferWithSmallAll.aspx';
    public $daifuUrl   = 'https://Pay.heepay.com/API/PayTransit/PayTransferWithSmallAll.aspx';
    public $queryDepositUrl = '';
    public $queryDaifuUrl  = 'https://Pay.heepay.com/API/PayTransit/QueryTransfer.aspx';
    public $queryBalanceUrl = 'https://www.heepay.com/API/Merchant/QueryBank.aspx';

    //预设商户号
    public $merchant    = '';

    //预设密钥
    public $key         = '';

    //回传字串
    public $success = 'ok';

    //白名单
    public $whiteIP = [''];

    public $channelCodeMap = [
        'BANK_CARD' => 'bankcard'
    ];

    public $bankMap = [
        '工行' => '1',
        '工商' => '1',
        '建设' => '2',
        '建行' => '2',
        '农业' => '3',
        '农行' => '3',
        '邮政' => '4',
        '邮政储蓄' => '4',
        '中国邮政' => '4',
        '交行' => '6',
        '招商' => '7',
        '招行' => '7',
        '光大' => '8',
        '浦发' => '9',
        '上海浦发' => '9',
        '浦东发展银行' => '9',
        '华夏' => '10',
        '广发' => '11',
        '中信' => '12',
        '兴业' => '13',
        '中国民生' => '14',
        '民生' => '14',
        '平安' => '18',
        '深圳发展银行' => '18',
        '浙江泰隆银行' => '38',
        '安徽省农村信用合作联社' => '42',
        '安徽农村信用合作联社' => '42',
        '安徽农村信用社' => '42',
        '安徽农村省信用社联合社' => '42',
        '安徽农信' => '42',
        '常熟农商银行' => '48',
        '常熟银行' => '48',
        '北京农村商业银行' => '49',
        '北京市农村信用合作联社' => '49',
        '北京农村信用合作联社' => '49',
        '北京市农村信用社联合社' => '49',
        '北京农村信用社联合社' => '49',
        '北京市农村信用社' => '49',
        '北京农村信用社' => '49',
        '北京市农信' => '49',
        '北京农信' => '49',
        '福建省农村信用合作联社' => '50',
        '福建农村信用合作联社' => '50',
        '福建省农信' => '50',
        '云南省农村信用合作联社' => '52',
        '云南农村信用合作联社' => '52',
        '云南农村信用社联合社' => '52',
        '云南省农信' => '52',
        '山东省农村信用合作联社' => '53',
        '山东农村信用合作联社' => '53',
        '山东农村信用社联合社' => '53',
        '山东省农信' => '53',
        '广东华兴' => '54',
        '华兴银行' => '54',
        '华兴' => '54',
        '浙江稠州银行' => '57',
        '稠州银行' => '57',
        '重庆市农村信用合作联社' => '58',
        '重庆农村信用合作联社' => '58',
        '重庆市农村信用社联合社' => '58',
        '重庆农村信用社联合社' => '58',
        '重庆市农村信用社' => '58',
        '重庆农村信用社' => '58',
        '重庆市农信' => '58',
        '重庆农信' => '58',
        '昆明市商业银行' => '70',
        '湖北省农村信用合作联社' => '72',
        '湖北农村信用合作联社' => '72',
        '湖北农村信用社联合社' => '72',
        '湖北省农信' => '72',
        '浙江省农村信用合作联社' => '73',
        '浙江农村信用合作联社' => '73',
        '浙江农村信用社联合社' => '73',
        '浙江省农信' => '73',
        '广西省农村信用合作联社' => '86',
        '广西农村信用合作联社' => '86',
        '广西农村信用社联合社' => '86',
        '广西省农信' => '86',
        '广西壮族自治区农村信用社联合社' => '86',
        '广西壮族自治区农村信用社' => '86',
        '长沙市商业银行' => '89',
        '吉林农村信用社联合社' => '95',
        '吉林省农' => '95',
        '东莞市商业银行' => '97',
        '桂林银行' => '99',
        '江苏省农村信用合作联社' => '104',
        '江苏农村信用合作联社' => '104',
        '江苏农村信用社联合社' => '104',
        '江苏省农信' => '104',
        '顺德农村银行' => '105',
        '广东顺德农村商业银行' => '105',
        '顺德市农村信用合作联社' => '105',
        '顺德农村信用合作联社' => '105',
        '顺德市农村信用社联合社' => '105',
        '顺德农村信用社联合社' => '105',
        '顺德市农村信用社' => '105',
        '顺德农村信用社' => '105',
        '顺德市农信' => '105',
        '顺德农信' => '105',
        '广西北部湾' => '112',
        '张家口银行' => '113',
        '华润银行' => '114',
        '江苏吴江农村商业银行' => '117',
        '吴江市农村商业银行' => '117',
        '东莞市农村信用合作联社' => '127',
        '东莞农村信用合作联社' => '127',
        '东莞市农村信用社联合社' => '127',
        '东莞农村信用社联合社' => '127',
        '东莞市农村信用社' => '127',
        '东莞农村信用社' => '127',
        '东莞市农信' => '127',
        '东莞农信' => '127',
        '海南省农村信用合作联社' => '131',
        '海南农村信用合作联社' => '131',
        '海南农村信用社联合社' => '131',
        '海南省农信' => '131',
        '天津农村商业银行' => '135',
        '浙江民泰银行' => '138',
        '浙江民泰' => '138',
        '江西省农村信用合作联社' => '164',
        '江西农村信用合作联社' => '164',
        '江西农村信用社联合社' => '164',
        '江西省农信' => '164',
        '广东省农村信用合作联社' => '165',
        '广东农村信用合作联社' => '165',
        '广东农村信用社联合社' => '165',
        '广东省农信' => '165',
        '河南省农村信用合作联社' => '166',
        '河南农村信用合作联社' => '166',
        '河南农村信用社联合社' => '166',
        '河南省农信' => '166',
        '辽宁省农村信用合作联社' => '167',
        '辽宁农村信用合作联社' => '167',
        '辽宁农村信用社联合社' => '167',
        '辽宁省农信' => '167',
        '黑龙江省农村信用合作联社' => '168',
        '黑龙江农村信用合作联社' => '168',
        '黑龙江农村信用社联合社' => '168',
        '黑龙江省农信' => '168',
        '湖南省农村信用合作联社' => '169',
        '湖南农村信用合作联社' => '169',
        '湖南农村信用社联合社' => '169',
        '湖南省农信' => '169',
        '河北省农村信用合作联社' => '170',
        '河北农村信用合作联社' => '170',
        '河北农村信用社联合社' => '170',
        '河北省农信' => '170',
        '甘肃省农村信用合作联社' => '171',
        '甘肃农村信用合作联社' => '171',
        '甘肃农村信用社联合社' => '171',
        '甘肃省农信' => '171',
        '山西省农村信用合作联社' => '172',
        '山西农村信用合作联社' => '172',
        '山西农村信用社联合社' => '172',
        '山西省农信' => '172',
        '陕西省农村信用合作联社' => '173',
        '陕西农村信用合作联社' => '173',
        '陕西农村信用社联合社' => '173',
        '陕西省农信' => '173',
        '贵州省农村信用合作联社' => '174',
        '贵州农村信用合作联社' => '174',
        '贵州农村信用社联合社' => '174',
        '贵州省农信' => '174',
        '内蒙古农村信用合作联社' => '175',
        '内蒙古自治区农村信用合作联社' => '175',
        '内蒙古农村信用社联合社' => '175',
        '内蒙古农村信用社' => '175',
        '内蒙古自治区农信' => '175',
        '新疆农村信用合作联社' => '176',
        '新疆自治区农村信用合作联社' => '176',
        '新疆农村信用社联合社' => '176',
        '新疆自治区农信' => '176',
        '四川省农村信用合作联社' => '177',
        '四川农村信用合作联社' => '177',
        '四川农村信用社联合社' => '177',
        '四川省农信' => '177',
        '成都农商' => '178',
        '长沙农商' => '179',
        '三亚农商' => '180',
        '浙江温州瓯海农商' => '181',
        '瓯海农商' => '181',
        '吉安农商银行' => '183',
        '吉安农商' => '183',
        '南宁市农村信用合作联社' => '187',
        '南宁市区农村信用社联合社' => '187',
        '南宁市农村信用社联合社' => '187',
        '南宁市区农村信用社' => '187',
        '南宁市农村信用社' => '187',
        '南宁市区农信' => '187',
        '南宁市农信' => '187',
        '星展' => '228',
        '四川天府' => '243',
        '天府银行' => '243',
        '青海农村信用合作联社' => '328',
        '青海省农村信用社联合社' => '328',
        '青海农村信用社联合社' => '328',
        '青海省农村信用社' => '328',
        '青海农村信用社' => '328',
        '青海省农信' => '328',
        '青海农信' => '328',
        '环县农村信用社' => '331',
        '环县农信' => '331',

        '工商银行' => '1',
        '中国工商银行' => '1',
        '建设银行' => '2',
        '中国建设银行' => '2',
        '农业银行' => '3',
        '中国农业银行' => '3',
        '邮政银行' => '4',
        '邮政储蓄银行' => '4',
        '中国邮政储蓄银行' => '4',
        '中国银行' => '5',
        '交通银行' => '6',
        '招商银行' => '7',
        '光大银行' => '8',
        '中国光大银行' => '8',
        '浦发银行' => '9',
        '上海浦东发展银行' => '9',
        '华夏银行' => '10',
        '广发银行' => '11',
        '广东发展银行' => '11',
        '中信银行' => '12',
        '兴业银行' => '13',
        '民生银行' => '14',
        '中国民生银行' => '14',
        '杭州银行' => '15',
        '上海银行' => '16',
        '宁波银行' => '17',
        '平安银行' => '18',
        '上海农村商业银行' => '20',
        '南京银行' => '21',
        '广州银行' => '22',
        '渤海银行' => '23',
        '徽商银行' => '25',
        '江苏银行' => '26',
        '齐鲁银行' => '27',
        '温州银行' => '30',
        '浙商银行' => '32',
        '北京银行' => '33',
        '潍坊银行' => '36',
        '浙江泰隆商业银行' => '38',
        '济宁银行' => '39',
        '台州银行' => '40',
        '汉口银行' => '41',
        '安徽省农村信用社' => '42',
        '郑州银行' => '43',
        '中原银行' => '44',
        '宜宾商业银行' => '45',
        '莱商银行' => '46',
        '日照银行' => '47',
        '江苏常熟农村商业银行' => '48',
        '北京农商银行' => '49',
        '福建省农村信用社联合社' => '50',
        '福建省农村信用社' => '50',
        '福建农村信用社' => '50',
        '福建农信' => '50',
        '齐商银行' => '51',
        '云南省农村信用社联合社' => '52',
        '云南省农村信用社' => '52',
        '云南农村信用社' => '52',
        '云南农信' => '52',
        '山东省农村信用社联合社' => '53',
        '山东省农村信用社' => '53',
        '山东农村信用社' => '53',
        '山东农信' => '53',
        '广东华兴银行' => '54',
        '江西银行' => '55',
        '东营银行' => '56',
        '浙江稠州商业银行' => '57',
        '重庆农村商业银行' => '58',
        '晋城银行' => '59',
        '秦农银行' => '60',
        '长安银行' => '61',
        '成都银行' => '62',
        '恒丰银行' => '63',
        '承德银行' => '64',
        '绍兴银行' => '65',
        '广东南粤银行' => '66',
        '青岛银行' => '67',
        '江苏长江商行' => '68',
        '包商银行' => '69',
        '富滇银行' => '70',
        '自贡市商业银行' => '71',
        '湖北省农村信用社联合社' => '72',
        '湖北省农村信用社' => '72',
        '湖北农村信用社' => '72',
        '湖北农信' => '72',
        '浙江省农村信用社联合社' => '73',
        '浙江省农村信用社' => '73',
        '浙江农村信用社' => '73',
        '浙江农信' => '73',
        '葫芦岛银行' => '74',
        '昆仑银行' => '75',
        '苏州银行' => '76',
        '湖州银行' => '77',
        '泉州银行' => '78',
        '广州农村商业银行' => '79',
        '太仓农村商业银行' => '81',
        '烟台银行' => '82',
        '上饶银行' => '83',
        '绵阳市商业银行' => '84',
        '德州银行' => '85',
        '广西省农村信用社联合社' => '86',
        '广西省农村信用社' => '86',
        '广西农村信用社' => '86',
        '广西农信' => '86',
        '柳州银行' => '87',
        '新韩银行中国' => '88',
        '长沙银行' => '89',
        '黄河农村商业银行' => '90',
        '鞍山银行' => '91',
        '龙江银行' => '92',
        '河北银行' => '93',
        '内蒙古银行' => '94',
        '吉林省农村信用社联合社' => '95',
        '吉林省农村信用社' => '95',
        '吉林农村信用社' => '95',
        '吉林农信' => '95',
        '浙江三门银座村镇银行' => '96',
        '东莞银行' => '97',
        '泰安银行' => '98',
        '桂林银行股份有限公司' => '99',
        '昆山农村商业银行' => '100',
        '攀枝花市商业银行' => '101',
        '西安银行' => '102',
        '营口银行' => '103',
        '江苏省农村信用社联合社' => '104',
        '江苏省农村信用社' => '104',
        '江苏农村信用社' => '104',
        '江苏农信' => '104',
        '顺德农村商业银行' => '105',
        '张家港农村商业银行' => '106',
        '重庆黔江银座村镇银行' => '107',
        '临商银行' => '108',
        '洛阳银行' => '109',
        '邢台银行' => '110',
        '韩亚银行' => '111',
        '广西北部湾银行' => '112',
        '张家口市商业银行' => '113',
        '珠海华润银行' => '114',
        '天津银行' => '115',
        '阜新银行' => '116',
        '吴江农村商业银行' => '117',
        '友利银行' => '118',
        '北京顺义银座村镇银行' => '119',
        '晋商银行' => '120',
        '赣州银行' => '121',
        '鄞州银行' => '122',
        '兰州银行' => '123',
        '锦州银行' => '124',
        '邯郸市商业银行' => '125',
        '深圳福田银座村镇银行' => '126',
        '东莞农村商业银行' => '127',
        '乌鲁木齐市商业银行' => '128',
        '浙江景宁银座村镇银行' => '129',
        '威海市商业银行' => '130',
        '海南省农村信用社联合社' => '131',
        '海南省农村信用社' => '131',
        '海南农村信用社' => '131',
        '海南农信' => '131',
        '商丘银行' => '132',
        '鄂尔多斯银行' => '133',
        '江西赣州银座村镇银行' => '134',
        '天津农商银行' => '135',
        '重庆银行' => '136',
        '宁夏银行' => '137',
        '浙江民泰商业银行' => '138',
        '长城华西银行' => '140',
        '廊坊银行' => '141',
        '沧州银行' => '142',
        '福建海峡银行' => '143',
        '嘉兴银行' => '144',
        '吉林银行' => '145',
        '青海银行' => '146',
        '重庆渝北银座村镇银行' => '147',
        '枣庄银行' => '148',
        '武汉农村商业银行' => '149',
        '重庆三峡银行' => '150',
        '南洋商业银行' => '151',
        '恒生银行' => '152',
        '集友银行' => '153',
        '大众银行' => '154',
        '永亨银行' => '155',
        '上海商业银行' => '156',
        '永隆银行' => '157',
        '中信嘉华银行' => '158',
        '华南商业银行' => '159',
        '保定银行' => '161',
        '上海华瑞银行' => '162',
        '九江银行' => '163',
        '江西省农村信用社联合社' => '164',
        '江西省农村信用社' => '164',
        '江西农村信用社' => '164',
        '江西农信' => '164',
        '广东省农村信用社联合社' => '165',
        '广东省农村信用社' => '165',
        '广东农村信用社' => '165',
        '广东农信' => '165',
        '河南省农村信用社联合社' => '166',
        '河南省农村信用社' => '166',
        '河南农村信用社' => '166',
        '河南农信' => '166',
        '辽宁省农村信用社联合社' => '167',
        '辽宁省农村信用社' => '167',
        '辽宁农村信用社' => '167',
        '辽宁农信' => '167',
        '黑龙江省农村信用社联合社' => '168',
        '黑龙江省农村信用社' => '168',
        '黑龙江农村信用社' => '168',
        '黑龙江农信' => '168',
        '湖南省农村信用社联合社' => '169',
        '湖南省农村信用社' => '169',
        '湖南农村信用社' => '169',
        '湖南农信' => '169',
        '河北省农村信用社联合社' => '170',
        '河北省农村信用社' => '170',
        '河北农村信用社' => '170',
        '河北农信' => '170',
        '甘肃省农村信用社联合社' => '171',
        '甘肃省农村信用社' => '171',
        '甘肃农村信用社' => '171',
        '甘肃农信' => '171',
        '山西省农村信用社联合社' => '172',
        '山西省农村信用社' => '172',
        '山西农村信用社' => '172',
        '山西农信' => '172',
        '陕西省农村信用社联合社' => '173',
        '陕西省农村信用社' => '173',
        '陕西农村信用社' => '173',
        '陕西农信' => '173',
        '贵州省农村信用社联合社' => '174',
        '贵州省农村信用社' => '174',
        '贵州农村信用社' => '174',
        '贵州农信' => '174',
        '内蒙古自治区农村信用社联合社' => '175',
        '内蒙古自治区农村信用社' => '175',
        '内蒙古农信' => '175',
        '新疆自治区农村信用社联合社' => '176',
        '新疆自治区农村信用社' => '176',
        '新疆农村信用社' => '176',
        '新疆农信' => '176',
        '四川省农村信用社联合社' => '177',
        '四川省农村信用社' => '177',
        '四川农村信用社' => '177',
        '四川农信' => '177',
        '成都农商银行' => '178',
        '长沙农商银行' => '179',
        '三亚农商银行' => '180',
        '浙江温州瓯海农村商业银行' => '181',
        '广东揭西农村商业银行' => '182',
        '吉安农村商业银行' => '183',
        '广西银海国民村镇银行' => '184',
        '宁夏中宁青银村镇银行' => '185',
        '湖南宁乡农村商业银行' => '186',
        '南宁市区农村信用合作联社' => '187',
        '雷山县农村信用合作联社西江信用社' => '188',
        '保亭黎族苗族自治县农村信用合作联社营业部' => '189',
        '湖南星沙农村商业银行' => '190',
        '新野县农村信用合作联社' => '191',
        '杭州联合银行' => '192',
        '赤壁农村商业银行' => '193',
        '甘肃陇西农村商业银行' => '194',
        '大理市农村商业银行' => '195',
        '广东翁源农村商业银行' => '196',
        '洛阳农村商业银行' => '197',
        '广东南海农村商业银行' => '198',
        '佛山市三水区农村信用社合作联社西南信用社' => '199',
        '贵州遵义汇川农村商业银行' => '200',
        '哈尔滨农村商业银行' => '202',
        '宁明县农村商业银行' => '203',
        '六盘水农村商业银行' => '204',
        '江西武宁农村商业银行' => '205',
        '勐海县农村信用合作联社' => '206',
        '浙江安吉农村商业银行' => '207',
        '贵州凯里农村商业银行' => '208',
        '台山市白沙农村信用合作联社白沙信用社' => '209',
        '韶关市新丰县农村信用合作联社' => '210',
        '青岛农村商业银行' => '211',
        '宣威市农村信用合作联社' => '212',
        '许昌农村商业银行' => '213',
        '河北高碑店农村商业银行' => '214',
        '四川峨眉山农村商业银行' => '215',
        '南宁市邕宁区农村信用合作联社五象信用社' => '216',
        '江苏江南农村商业银行股份公司' => '217',
        '雷山县农村信用合作联社' => '218',
        '江苏江阴农村商业银行股份有限公司' => '219',
        '华融湘江银行' => '220',
        '国家开发银行' => '221',
        '江苏泗阳农村商业银行' => '222',
        '温州民商银行' => '223',
        '汇丰银行' => '224',
        '创兴银行' => '225',
        '三菱日联银行(中国)有限公司' => '226',
        '大华银行(中国)有限公司' => '227',
        '星展银行' => '228',
        '厦门国际银行' => '229',
        '韶山光大村镇银行' => '230',
        '泸州市商业银行' => '231',
        '贵州银行' => '232',
        '中山农村商业银行股份有限公司' => '233',
        '山东临沂兰山农村合作银行' => '234',
        '苏州农村商业银行' => '235',
        '山东招远农村商业银行' => '236',
        '江西安义农村商业银行' => '237',
        '江苏紫金农村商业银行' => '238',
        '网商银行' => '239',
        '浙江衢州柯城农村商业银行' => '240',
        '甘肃银行' => '241',
        '山东威海农村商业银行' => '242',
        '四川天府银行' => '243',
        '山西临猗农村商业银行' => '244',
        '盛京银行' => '245',
        '武汉众邦银行' => '246',
        '焦作中旅银行' => '247',
        '江苏句容农村商业银行' => '248',
        '无锡农村商业银行' => '249',
        '姜堰农村商业银行' => '250',
        '宜兴农村商业银行' => '251',
        '邳州农村商业银行' => '252',
        '平顶山市新华区农村信用合作联社' => '253',
        '广西全州农村合作银行' => '254',
        '海南银行' => '255',
        '广西来宾桂中农村合作银行' => '256',
        '河北武强农村商业银行' => '257',
        '河南杞县农村商业银行' => '258',
        '安徽凤阳农村商业银行' => '259',
        '江苏宝应农村商业银行' => '260',
        '湖南常宁农村商业银行' => '261',
        '江苏滨海农村商业银行' => '262',
        '江苏阜宁农村商业银行' => '263',
        '贵州平塘农村商业银行' => '264',
        '湖南江永农村商业银行' => '265',
        '河南卢氏农村商业银行' => '266',
        '山西灵石农村商业银行' => '267',
        '浙江龙游农村商业银行' => '268',
        '广东阳山农村商业银行' => '269',
        '黄龙县农村信用合作联社' => '270',
        '贵阳观山湖富民村镇银行' => '271',
        '贵州普定农村商业银行' => '272',
        '贵州遵义农村商业银行' => '273',
        '徐州农商银行' => '274',
        '济南农村商业银行' => '275',
        '贵州瓮安农村商业银行' => '276',
        '石狮农村商业银行' => '277',
        '蒙商银行' => '278',
        '浙江舟山普陀农村商业银行' => '279',
        '内蒙古伊金霍洛农村商业银行' => '280',
        '郑州农村商业银行' => '281',
        '浙江长兴农村商业银行' => '282',
        '鄂尔多斯农村商业银行' => '283',
        '贵州修文农村商业银行' => '284',
        '四川南部农村商业银行' => '285',
        '巴彦淖尔河套农村商业银行' => '286',
        '眉山农村商业银行' => '287',
        '衡阳农村商业银行' => '288',
        '广西贵港荷城农村商业银行' => '289',
        '贵州龙里农村商业银行' => '290',
        '湖南三湘银行' => '291',
        '贵阳农村商业行' => '292',
        '洪洞县洪都村镇银行' => '293',
        '唐山银行' => '294',
        '南昌银行' => '295',
        '珠海农村商业银行' => '296',
        '中信百信银行' => '297',
        '江苏东台农村商业银行' => '298',
        '湖南临湘农村商业银行' => '299',
        '阿拉善右旗农村信用合作联社' => '300',
        '四川阆中农村商业银行股份有限公司' => '301',
        '泸州银行股份有限公司' => '302',
        '广西柳江农村合作银行' => '303',
        '福建晋江农村商业银行股份有限公司' => '304',
        '浙江平阳浦发村镇银行股份有限公司' => '305',
        '邯郸银行股份有限公司' => '306',
        '宁波通商银行股份有限公司' => '307',
        '辽宁大石桥隆丰村镇银行股份有限公司' => '308',
        '浙江温州龙湾农村商业银行股份有限公司' => '309',
        '中国农业发展银行' => '310',
        '亳州药都农村商业银行股份有限公司' => '311',
        '内江农村商业银行股份有限公司' => '312',
        '河南偃师农村商业银行股份有限公司' => '313',
        '合肥科技农村商业银行股份有限公司' => '314',
        '宁夏中宁农村商业银行股份有限公司' => '315',
        '包头农村商业银行股份有限公司' => '316',
        '湖北咸宁农村商业银行股份有限公司' => '317',
        '广东怀集农村商业银行股份有限公司' => '318',
        '平坝鼎立村镇银行有限责任公司' => '319',
        '陕西秦农农村商业银行股份有限公司' => '320',
        '河南宝丰农村商业银行股份有限公司' => '321',
        '山东青州农村商业银行' => '322',
        '宁夏盐池农村商业银行股份有限公司' => '323',
        '安徽泾县农村商业银行股份有限公司' => '324',
        '天津滨海农村商业银行股份有限公司' => '326',
        '大连农村商业银行' => '327',
        '青海省农村信用社联合社' => '328',
        '青海省农村信用社' => '328',
        '青海农村信用社' => '328',
        '青海农信' => '328',
        '江苏丹阳农村商业银行股份有限公司' => '329',
        '山西太谷农村商业银行股份有限公司' => '330',
        '环县农村信用合作联社' => '331',
        '雅安市商业银行股份有限公司' => '332',
        '山东沂水农村商业银行' => '333',
        '贵州织金农村商业银行股份有限公司' => '334',
        '辉县珠江村镇银行股份有限公司' => '335',
        '福建南安农村商业银行股份有限公司' => '336',
        '河南正阳农村商业银行股份有限公司' => '337',
        '湖北监利农村商业银行股份有限公司' => '338',
        '内蒙古呼和浩特金谷农村商业银行股份有限公司' => '339',
        '河南叶县农村商业银行股份有限公司' => '340',
        '湖南汨罗农村商业银行股份有限公司' => '341',
        '江苏扬州农村商业银行股份有限公司' => '342',
        '江苏江都农村商业银行股份有限公司' => '343',
        '泰安泰山农村商业银行' => '344',
        '河南沁阳农村商业银行股份有限公司' => '345',
        '重庆市武隆融兴村镇银行有限责任公司' => '346',
        '湖北宜城农村商业银行股份有限公司' => '347',
        '南阳村镇银行股份有限公司' => '348',
        '重庆九龙坡民泰村镇银行股份有限公司' => '349',
        '山东高唐农村商业银行' => '350',
        '陕西宝鸡渭滨农村商业银行股份有限公司' => '351',
        '山东莘县农村商业银行' => '352',
        '江西余干农村商业银行股份有限公司' => '353',
        '湖南耒阳农村商业银行股份有限公司' => '354',
        '盘锦银行股份有限公司' => '355',
        '哈密市商业银行股份有限公司' => '356',
        '新疆银行股份有限公司' => '357',
        '辽宁大洼农村商业银行股份有限公司' => '358',
        '浙江禾城农村商业银行股份有限公司' => '359',
        '茂名电白长江村镇银行股份有限公司' => '360',
        '江苏泰兴农村商业银行股份有限公司' => '361',
        '福建漳州农村商业银行股份有限公司' => '362',
        '库尔勒银行股份有限公司' => '363',
        '太原市城区农村信用合作联社' => '364',
        '金华银行股份有限公司' => '365',
        '浙江义乌联合村镇银行股份有限公司' => '366',
        '本溪银行股份有限公司' => '367',
        '江西芦溪农村商业银行股份有限公司' => '368',
        '中银富登村镇银行股份有限公司' => '369',
        '湖南通道农村商业银行股份有限公司' => '370',
        '宁城蒙商村镇银行有限责任公司' => '371',
        '宣城皖南农村商业银行股份有限公司' => '372',
        '石嘴山银行股份有限公司' => '373',
        '广东廉江农村商业银行股份有限公司' => '374',
        '长治银行' => '375',
        '正蓝旗汇泽村镇银行有限责任公司' => '376',
        '盘锦农村商业银行股份有限公司' => '377',
        '浙江东阳农村商业银行股份有限公司' => '378',
        '广西巴马农村商业银行股份有限公司' => '379',
        '云南勐腊农村商业银行股份有限公司' => '380',
        '泉州农村商业银行股份有限公司' => '381',
        '广西贺州桂东农村合作银行' => '382',
        '新疆阿克苏农村商业银行股份有限公司' => '383',
        '遂宁农村商业银行股份有限公司' => '384',
        '广东罗定农村商业银行股份有限公司' => '385',
        '江苏兴化农村商业银行股份有限公司' => '386',
        '辽宁义县锦银村镇银行股份有限公司' => '387',
        '河南安阳商都农村商业银行股份有限公司' => '388',
        '黑龙江方正农村商业银行股份有限公司' => '389',
        '朝阳银行股份有限公司' => '390',
        '贵州天柱农村商业银行股份有限公司' => '391',
        '湘西长行村镇银行股份有限公司' => '392',
        '诏安县农村信用合作联社' => '393',
        '辽阳银行股份有限公司' => '394',
        '广西岑溪农村商业银行股份有限公司' => '395',
        '石家庄鹿泉农村商业银行股份有限公司' => '396',
    ];

    /*   代收   */
    public function sendDeposit($data)
    {
        $this->key = $data['key'];

        $post = [
            'version' => 3,
            'pay_type' => 20,
            'agent_id' => $data['merchant'],
            'pay_amt' => $data['request']->amount,
            'agent_bill_id' => $data['request']->system_order_number,
            'notify_url' => $data['callback_url'],
            'return_url' => '',
            'user_ip' => str_replace('.', '_', $data['request']->client_ip ?? $data['client_ip']),
            'agent_bill_time' => now()->format('YmdHis'),
            'goods_name' => '话费',
            'remark' => '',
            'bank_card_type' => 1
        ];

        if(isset($data['request']->real_name) && $data['request']->real_name != ''){
            $post['playerName'] = $data['request']->real_name;
        }

        $post['sign'] = $this->makesign($post);

        Log::debug(self::class, compact('post'));

        try {
            $response = Http::withOptions(
                ['proxy' => ['http' => $data['proxy'], 'https' => $data['proxy']]]
            )->request('POST', $data['url'], [
                'json' => $post
            ]);
            $row = json_decode($response->getBody(), true);
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'post', 'message'));
            return ['success' => false];
        }

        Log::debug(self::class, compact('data', 'post', 'row'));

        if (!isset($row['errorCode'])) {
            $ret = [
                'order_number' => $data['request']->order_number,
                'amount' => $row['totalAmt'],
                'pay_url'   => $row['payUrl'],
                'created_at' => date('Y-m-d H:i:s'),
            ];
            return ['success' => true, 'data' => $ret];
        } else {
            return ['success' => false];
        }
    }

    public function queryDeposit($data)
    {
        return ['success' => true,'msg' => '原因'];
    }

    /*   代付   */
    public function sendDaifu($data)
    {
        if (!isset($this->bankMap[$data['request']->bank_name])) {
            return ['success' => false, 'msg' => '不支持此银行代付，请联系客服'];
        }

        $this->key = $data['key'];
        $code = $this->bankMap[$data['request']->bank_name];

        $post_data = [
            'version' => 3,
            'agent_id' => $data['merchant'],
            'batch_amt' => $data['request']->amount,
            'batch_no'  => $data['request']->order_number,
            'batch_num' => 1,
            'notify_url' => $data['callback_url'],
            'ext_param1' => '',
            'detail_data' => implode('^', [
                $data['request']->order_number,
                $code,
                0,
                $data['request']->bank_card_number,
                $data['request']->bank_card_holder_name,
                $data['request']->amount,
                '代发工资',
                (isset($data['request']->bank_province) && !empty($data['request']->bank_province)) ? $data['request']->bank_province : $data['request']->bank_name,
                (isset($data['request']->bank_city) && !empty($data['request']->bank_city)) ? $data['request']->bank_city : $data['request']->bank_name,
                $data['request']->bank_name,
            ])
        ];

        $post_data['sign'] = $this->makesign($post_data);

        $originDetail = $post_data['detail_data'];

        $detailData = bin2hex(openssl_encrypt(iconv("utf-8","gbk//IGNORE", $originDetail), 'DES-EDE3', $data['key2'], OPENSSL_RAW_DATA));

        $post_data['detail_data'] = $detailData;

        Log::info(self::class, compact('originDetail', 'detailData'));

        try {
            $response = Http::timeout(20)->retry(3, 1000)->asForm()->withOptions(
                ['proxy' => ['http' => $data['proxy'], 'https' => $data['proxy']]]
            )->post($data['url'], $post_data);

            $xmlResult = mb_convert_encoding($response->getBody()->getContents(), 'UTF-8', 'GB2312');
            $result = simplexml_load_string($xmlResult);
        } catch (ConnectionException $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'post_data', 'message'));
            return ['success' => false, 'msg' => '代付超时', 'timeout' => true];
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'post_data', 'message'));
            return ['success' => false, 'msg' => '代付失败'];
        }

        Log::debug(self::class, compact('data', 'post_data', 'xmlResult', 'result'));

        $code = (string)$result->ret_code;
        if(isset($code) && in_array($code,['0000'])){
            return ['success' => true];
        } else {
            return ['success' => false, 'msg' => (string)$result->ret_msg];
        }
    }

    public function queryDaifu($data)
    {
        $this->key = $data['key'];

        $post_data = [
            'version' => 3,
            'batch_no' => $data['request']->order_number,
            'agent_id' => $data['merchant'],
        ];
        $post_data['sign'] = $this->makeQuerySign($post_data);

        try {
            $response = Http::timeout(10)->asForm()->withOptions(
                ['proxy' => ['http' => $data['proxy'], 'https' => $data['proxy']]]
            )->post($data['queryDaifuUrl'], $post_data);

            $xmlResult = mb_convert_encoding($response->getBody()->getContents(), 'UTF-8', 'GB2312');
            $result = simplexml_load_string($xmlResult);
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'post_data', 'message'));
            return ['success' => false, 'timeout' => true, 'status' => Transaction::STATUS_PAYING];
        }

        Log::debug(self::class, compact('data', 'post_data', 'xmlResult', 'result'));

        $msg = (string)$result->ret_msg;
        $isAmountRight = (string)$result->batch_amt == $data['request']->amount;
        $isOrderIdRight = (string)$result->batch_no == $data['request']->order_number;

        if(empty($msg) && $isAmountRight && $isOrderIdRight){
            return ['success' => true, 'status' => Transaction::STATUS_PAYING];
        } else {
            return ['success' => false, 'msg' => $msg, 'status' => Transaction::STATUS_PAYING];
        }
    }

    /*   回调 => callback($request,訂單資料)   */
    public function callback($request, $transaction)
    {
        $data = $request->all();

        if ($data['batch_no'] != $transaction->order_number) {
            return ['error' => '订单编号不正确'];
        }

        if (isset($data['batch_amt']) && $data['batch_amt'] != $transaction->amount) {
            return ['error' => '金额不正确'];
        }

        if (isset($data['status']) && in_array($data['status'],['1'])) {
            return ['success' => true];
        }

        if (isset($data['status']) && in_array($data['status'],['-1'])) {
            return ['fail' => '驳回'];
        }

        return ['error' => '未知错误'];
    }

    public function queryBalance($data)
    {
        $this->key3 = $data['key3'];
        $queryData = [
            'version' => 1,
            'agent_id' => $data['merchant'],
        ];
        $queryData['sign'] = $this->makeBalanceSign($queryData);

        try {
            $response = Http::timeout(10)->withOptions(
                ['proxy' => ['http' => $data['proxy'], 'https' => $data['proxy']]]
            )->get($this->queryBalanceUrl, $queryData); // 這裡要用 www.heepay.com 不能用 $data['queryBalanceUrl']

            $result = $response->getBody()->getContents();
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'queryData', 'message'));
            return ['success' => false];
        }

        Log::debug(self::class, compact('data', 'queryData', 'result'));

        if (Str::startsWith($result, 'S')) {
            $balance = explode('=', explode('|', $result)[1])[1];

            ThirdChannelModel::where('id', $data['thirdchannelId'])->update(['balance' => $balance]);

            return $balance;
        } else {
            return 0;
        }

    }

    public function makesign($data)
    {
        $data['key'] = $this->key;
        ksort($data);

        $sign = http_build_query($data);

        return md5(strtolower(urldecode($sign)));
    }

    public function makeQuerySign($data)
    {
        $data['key'] = $this->key;

        return md5(strtolower("agent_id={$data['agent_id']}&batch_no={$data['batch_no']}&key={$data['key']}&version={$data['version']}"));
    }

    public function makeBalanceSign($data)
    {
        $data['key'] = $this->key3;

        return md5("version={$data['version']}&agent_id={$data['agent_id']}&key={$data['key']}");
    }
}
