<?php

namespace App\ThirdChannel;

use Illuminate\Http\Request;
use Illuminate\Support\Facades\Log;
use App\Utils\BCMathUtil;

use App\Model\ThirdChannel as ThirdChannelModel;
use App\Model\Transaction;

class JinDing extends ThirdChannel
{
    //Log名称
    public $log_name   = 'JinDing';
    public $type    = 1; //1:代收付 2:纯代收 3:纯代付

    //回调地址
    public $notify    = '';
    public $depositUrl   = 'https://www.9457168.com/louis/gateway.do';
    public $xiafaUrl   = 'https://www.9457168.com/louis/ap.do';
    public $daifuUrl   = 'https://www.9457168.com/louis/ap.do';
    public $queryDepositUrl    = 'https://www.9457168.com/louis/query.do';
    public $queryDaifuUrl  = 'https://www.9457168.com/louis/query.do';
    public $queryBalanceUrl = 'https://www.9457168.com/louis/spQuery.do';

    //预设商户号
    public $merchant    = '';

    //预设密钥
    public $key          = '';
    public $key2         = '';

    //回传字串
    public $success = 'SUCCESS';

    //白名单
    public $whiteIP = ['18.179.128.237'];

    public $channelCodeMap = [
        'BANK_CARD' => '17'
    ];

    public $bankMap = [
        "中国工商银行" => "001",
        "工商银行" => "001",
        "招商银行" => "006",
        "中国建设银行" => "002",
        "中国建设" => "002",
        "建设银行" => "002",
        "中国银行" => "003",
        "中国农业银行" => "004",
        "中国农业" => "004",
        "农业银行" => "004",
        "交通银行" => "005",
        "广发银行" => "018",
        "中国光大银行" => "012",
        "光大银行" => "372",
        "兴业银行" => "011",
        "平安银行" => "013",
        "中国民生银行" => "009",
        "民生银行" => "009",
        "华夏银行" => "014",
        "中国邮政储蓄银行" => "007",
        "邮政银行" => "007",
        "中国邮政" => "007",
        "宁波银行" => "019",
        "北京银行" => "015",
        "浙商银行" => "049",
        "广州银行" => "099",
        "长沙银行" => "168",
        "广西北部湾银行" => "041",
        "桂林银行" => "102",
        "东莞银行" => "051",
        "杭州银行" => "063",
        "江苏银行" => "017",
        "吉林银行" => "120",
        "南京银行" => "028",
        "恒丰银行" => "070",
        "深圳农商银行" => "032",
        "深圳农商" => "032",
        "深圳农商行" => "032",
        "深圳农村商业银行" => "033",
        "中信银行" => "008",
        "武汉农商银行" => "084",
        "驻马店银行" => "161",
        "武汉农村商业银行" => "084",
        "江苏宿豫东吴村镇银行" => "248",
        "威海银行" => "456",
        "上海银行" => "016",
        "遵义市商业银行" => "052",
        "哈尔滨银行" => "191",
        "青岛银行" => "105",
        "莱商银行" => "077",
        "齐鲁银行" => "110",
        "烟台银行" => "223",
        "柳州银行" => "192",
        "中国银盛" => "309",
        "中信百信银行股份有限公司" => "310",
        "中原银行股份有限公司" => "311",
        "重庆农村商业银行" => "148",
        "江苏江阴农村商业银行" => "158",
        "兴县汇泽村镇银行" => "373",
        //"重庆农商银行" => "148",
        //"重庆农商" => "148",
        "北京商业银行" => "345",
        "北京商银" => "345",
        "甘肃省农村信用社" => "163",
        "甘肃省农村信用社联合社" => "163",
        "甘肃省农信" => "163",
        "甘肃农村信用社联合社" => "163",
        "甘肃农村信用社" => "163",
        "甘肃农信" => "163",
        "湖北银行" => "065",
        "嘉兴银行" => "066",
        "湖北银行宜昌分行" => "085",
        "东莞农村商业银行" => "098",
        "湖北银行黄石分行" => "107",
        "东莞农村银行" => "219",
        "东莞农商银行" => "219",
        "东莞农商" => "219",
        "东莞农信" => "220",
        "湖南省农村信用社联合社" => "135",
        "湖南省农村信用社" => "135",
        "湖南省农信" => "135",
        "湖南农村信用社联合社" => "135",
        "湖南农村信用社" => "135",
        "湖南农信" => "135",
        "韩亚银行" => "142",
        "中国农村信用社" => "216",
        "中国农村商业银行" => "217",
        "泰隆银行" => "241",
        "江阴农商银行" => "390",
        //"稠州银行" => "025",
        "自贡银行" => "395",
        "西昌金信村镇银行" => "396",
        "西峰瑞信村镇银行" => "397",
        "西航南马村镇银行" => "398",
        //"民泰商业银行" => "093",
        //"民泰商银" => "093",
        //"银座村镇银行" => "521",
        "营口银行" => "100",
        "兰州银行" => "125",
        "自贡市商业银行" => "140",
        "临商银行" => "172",
        "江西银行" => "215",
        "江西农村信用社" => "153",
        "江西省农村信用社联合社" => "153",
        "江西省农信" => "153",
        "江西农村信用社联合社" => "153",
        "江西农信" => "153",
        "江苏省农村信用联合社" => "080",
        "江苏省农村信用社" => "080",
        "江苏省农信" => "080",
        "江苏农村信用社联合社" => "080",
        "江苏农村信用社" => "080",
        "江苏农信" => "080",
        "江苏省农村商业银行" => "201",
        "华融湘江银行" => "067",
        "大连银行" => "035",
        "沧州银行" => "279",
        "重庆三峡银行" => "079",
        "东营银行" => "264",
        "广东农信" => "111",
        "广东农村信用社" => "111",
        "广东农村信用社联合社" => "111",
        "广东省农信" => "111",
        "广东省农村信用社" => "111",
        "广东省农村信用社联合社" => "111",
        "广州农商" => "061",
        "广州农村商业银行" => "061",
        "广州农商银行" => "061",
        "广州省农村商业银行" => "061",
        "广州省农商银行" => "061",
        "广州省农商" => "061",
        "广州农信社" => "305",
        "广州花都稠州村镇银行" => "306",
        "蒙商银行" => "559",
        //"长春融丰" => "",
        "保定银行" => "196",
        "秦皇岛银行" => "197",
        "永清吉银村镇银行" => "280",
        "重庆银行" => "115",
        "张家口银行" => "265",
        "张家口市商业银行" => "055",
        "天津银行" => "176",
        "邯郸银行" => "050",
        "富滇银行" => "036",
        "徽商银行" => "090",
        "承德银行" => "173",
        "深圳宝安桂银村镇银行股份有限公司" => "198",
        "广东南海农村商业银行股份有限公司" => "199",
        //"阳光村镇银行" => "413",
        "阜新银行" => "083",
        "赣州银行有限公司" => "578",
        "赣州银行" => "113",
        "浙江泰隆商业银行" => "112",
        "乐山商业银行" => "341",
        "珠海华润银行" => "224",
        "顺德农商银行" => "046",
        "顺德农商" => "046",
        "成都农村商业银行" => "104",
        "成都农商银行" => "104",
        "成都农商" => "104",
        "上海农村商业银行" => "042",
        "上海农商银行" => "242",
        "上海农商" => "020",
        "盛京银行" => "130",
        "福建海峡银行" => "027",
        "郑州银行" => "034",
        "上海浦东发展银行" => "010",
        "浦发银行" => "010",
        "厦门银行" => "026",
        "平凉银行" => "349",
        "威海市商业银行" => "043",
        "周口银行" => "044",
        "库尔勒市商业银行" => "045",
        "国家开发银行" => "071",
        "浙江省农村信用社联合社" => "124",
        "浙江省农村信用社" => "124",
        "浙江省农信" => "124",
        "浙江农村信用社联合社" => "124",
        "浙江农村信用社" => "124",
        "浙江农信" => "124",
        "南昌银行" => "175",
        //"南宁江南国民村镇银行" => "",
        "江南村镇银行" => "394",
        "山东省农村信用社联合社" => "174",
        "山东省农村信用社" => "174",
        "山东省农信" => "174",
        "山东农村信用社联合社" => "174",
        "山东农村信用社" => "174",
        "山东农信" => "174",
        "中原银行" => "030",
        "乐山市商业银行" => "152",
        "吴江农商银行" => "177",
        "城市商业银行资金清算中心" => "178",
        "库尔勒银行" => "408",
        "忻州市忻府区秀都村镇银行有限责任公司" => "409",
        "河南省农村信用社" => "031",
        "河南省农村信用社联合社" => "031",
        "河南省农信" => "031",
        "河南农村信用社联合社" => "031",
        "河南农村信用社" => "031",
        "河南农信" => "031",
        "四川天府银行" => "194",
        "广西壮族自治区农村信用社联合社" => "580",
        "广西壮族自治区农村信用社" => "580",
        "代县泓都村镇银行有限责任公司" => "342",
        "北京中关村银行股份有限公司" => "343",
        "北京顺义银座村镇银行" => "344",
        "广西壮族自治区农信" => "040",
        "广西壮族自治区信用社联合社" => "040",
        "广西壮族自治区信用社" => "040",
        "广西农村信用社" => "040",
        "广西农村信用社联合社" => "040",
        "广西农信" => "040",
        "广西省农村信用" => "160",
        "广西农信银行" => "308",
        "福建省农村信用社联合社" => "029",
        "福建省农村信用社" => "029",
        "福建省农信社" => "029",
        "福建省农信" => "029",
        "福建农村信用社联合社" => "556",
        "福建农村信用社" => "556",
        "福建农信社" => "556",
        "福建农信" => "556",
        "湖北省农村信用社" => "037",
        "湖北省农信社" => "037",
        "湖北省农信" => "037",
        "湖北农村信用社" => "037",
        "湖北农信社" => "037",
        "湖北农信" => "037",
        "开封宋都农村商业银行" => "038",
        "开封市商业银行" => "146",
        "晋中银行" => "481",
        "晋中市商业银行" => "154",
        "晋城银行" => "082",
        "晋城银行JCBANK" => "082",
        //"银座银行" => "521",
        "安徽省农村信用社联合社" => "162",
        "安徽省农村信用社" => "162",
        "安徽省农信" => "162",
        "安徽农村信用社联合社" => "162",
        "安徽农村信用社" => "162",
        "安徽农信" => "162",
        "安徽新安银行" => "383",
        //"河南伊川农商银行" => "",
        "四川省农村信用社" => "075",
        "四川省农信社" => "075",
        "四川省农信" => "075",
        "四川农村信用社" => "075",
        "四川农信社" => "075",
        "四川农信" => "075",
        //"珠海市农村信用社" => "",
        "云南省农村信用社联合社" => "159",
        "云南省农村信用社" => "159",
        "云南省农信" => "318",
        "云南农村信用社联合社" => "318",
        "云南农村信用社" => "318",
        "云南农信" => "318",
        //"珠海农商银行" => "499",
        "青岛农商银行" => "445",
        "青岛农商" => "445",
        "常熟农商银行" => "278",
        "常熟农商" => "278",
        "常熟农村商业银行" => "119",
        "常州农村信用联社" => "121",
        "汉口银行" => "058",
        "江南农村商业银行" => "393",
        "江南农商" => "393",
        "九江银行" => "091",
        "洛阳银行" => "143",
        "深圳前海微众银行" => "517",
        "苏州银行" => "062",
        "台州银行" => "086",
        "台州农商银行" => "243",
        "微商银行" => "540",
        "温州银行" => "108",
        "萧山农商银行" => "536",
        "贵阳市商业银行" => "114",
        //"萧山农商" => "536",
        "长沙农商银行" => "363",
        "长沙农商" => "363",
        "紫金农商银行" => "535",
        //"紫金农商" => "535",
        "渤海银行" => "127",
        "龙江银行" => "116",
        "黑龙江省农村信用社联合社" => "225",
        "黑龙江省农村信用社" => "225",
        "黑龙江省农信" => "225",
        "黑龙江农村信用社联合社" => "225",
        "黑龙江农村信用社" => "225",
        "黑龙江农信" => "225",
        "林州中原村镇银行" => "281",
        "江苏惠山民泰村镇银行" => "283",
        "来安中银富登村镇银行" => "284",
        "辽阳银行" => "404",
        "齐商银行有限公司" => "405",
        "余杭农村商业银行" => "406",
        "辽阳市商业银行" => "164",
        "丹东银行" => "068",
        "九银村镇银行" => "287",
        "十堰农村商业银行" => "288",
        "万全家银村镇银行" => "289",
        "安阳银行" => "069",
        "白云德信村镇银行" => "359",
        "大连农商银行" => "298",
        "长子融汇村镇银行" => "360",
        "大城舜丰村镇银行" => "299",
        "大洼恒丰村镇银行股份有限公司" => "300",
        //"大连农商" => "298",
        "甘肃银行" => "358",
        "贵阳银行" => "205",
        "贵州银行" => "206",
        "桂林国民银行" => "482",
        "济宁银行" => "081",
        "农信银清算中心" => "092",
        "永兴沪农商村镇银行" => "351",
        "永吉吉庆村镇银行" => "352",
        "廊坊银行" => "094",
        "长安银行" => "203",
        "USDT" => "204",
        "西安银行" => "131",
        "包商银行" => "132",
        "本溪银行" => "350",
        "达州银行" => "412",
        "东亚银行" => "106",
        "抚顺银行" => "133",
        "贵州省农村信用社联合社" => "054",
        "贵州省农村信用社" => "054",
        "贵州省农信" => "054",
        "贵州农村信用社联合社" => "054",
        "贵州农村信用社" => "054",
        "贵州农信" => "054",
        "江苏太仓农村商业银行" => "072",
        "德阳商业银行" => "073",
        "宜宾市商业银行" => "074",
        "河北银行" => "170",
        "吉林农信银行" => "165",
        "吉林省农村信用社联合社" => "165",
        "吉林省农村信用社" => "165",
        "吉林省农信" => "165",
        "吉林农村信用社联合社" => "165",
        "吉林农村信用社" => "165",
        "吉林农信" => "165",
        "安庆银行" => "379",
        "江苏农商银行" => "391",
        "江苏农商" => "391",
        "金华银行" => "169",
        "锦州银行" => "056",
        "昆仑银行" => "076",
        "昆山农商银行" => "021",
        "昆山农商" => "021",
        "天津武清村镇银行" => "266",
        "青海银行" => "103",
        "青海省农村信用社联合社" => "446",
        "青海省农村信用社" => "446",
        "青海省农信" => "446",
        "青海农村信用社联合社" => "446",
        "青海农村信用社" => "446",
        "青海农信" => "446",
        "上虞农商银行" => "252",
        "上虞农商" => "252",
        "应县金都村镇银行" => "253",
        "绍兴银行" => "053",
        "太仓农商银行" => "331",
        "太仓农商" => "331",
        "泰安银行" => "484",
        "泰安市商业银行" => "087",
        "许昌银行" => "088",
        "许昌新浦村镇银行" => "400",
        "天津农商银行" => "109",
        "天津农商" => "109",
        "南充市商业银行" => "117",
        "邢台银行" => "134",
        "张家港农村商业银行" => "123",
        "江苏射阳农村商业银行" => "392",
        //"张家港农商银行" => "123",
        //"张家港农商" => "123",
        "长江商业银行" => "362",
        "长江商银" => "362",
        "绵阳商业银行" => "519",
        "屯留三禾村镇银行" => "332",
        "辽宁大石桥隆丰村镇银行" => "401",
        "开鲁蒙银行" => "333",
        "文水县润都村镇银行有限公司" => "334",
        //"绵阳商银" => "519",
        "山西省农村信用社联合社" => "254",
        "山西省农村信用社" => "254",
        "山西省农信" => "254",
        "山西农村信用社联合社" => "254",
        "山西农村信用社" => "254",
        "山西省农村信用合作联社" => "254",
        "山西农信" => "254",
        "辉县珠江村镇银行" => "255",
        "上海松江富明村镇银行" => "256",
        "阳泉商业银行" => "415",
        "桦甸惠民村镇银行" => "483",
        "海南省农村信用社联合社" => "208",
        "海南省农村信用社" => "208",
        "海南省农信" => "208",
        "海南农村信用社联合社" => "208",
        "海南农村信用社" => "208",
        "海南农信" => "208",
        "广东农信连南农村信用社" => "211",
        "陆丰农商银行" => "212",
        "黄河农信银行" => "226",
        "黄河农村信用社联合社" => "226",
        "黄河农村信用社" => "226",
        "黄河农信" => "226",
        "江门农商银行" => "388",
        "江门农商" => "388",
        "宁夏银行" => "089",
        "宁夏黄河农村商业银行" => "059",
        "广东发展银行" => "144",
        //"宁夏黄河农商" => "059",
        "深圳福田银座村镇银行" => "235",
        "山东宁阳农村商业银行" => "236",
        "深圳坪山珠江村镇银行" => "237",
        "茌平泸农商村镇银行" => "238",
        "江苏长江商业银行" => "239",
        "四会农商银行" => "240",
        "石嘴山银行" => "149",
        "苏州农商银行" => "263",
        "山东金乡蓝海村镇银行" => "301",
        "山西孝义农村商业银行" => "302",
        //"苏州农商" => "263",
        "天津滨海农村商业银行" => "328",
        "天津滨海农商" => "328",
        "天津滨海德商村镇银行" => "329",
        "天津静海新华村镇银行" => "330",
        "枣庄银行" => "285",
        "江苏苏州农村商业银行" => "286",
        "浙江网商银行" => "039",
        "浙江网商" => "039",
        "阳泉银行" => "129",
        //"广东农商银行" => "",
        //"广东农商" => "",
        "海南银行" => "209",
        "佛山农村商业银行" => "210",
        "五常惠民村镇银行" => "323",
        "元氏信融村镇银行" => "324",
        "唐山银行" => "478",
        "北京农村商业银行" => "138",
        "北京农商银行" => "022",
        "北京农商" => "022",
        "友利银行" => "023",
        "乌海银行" => "314",
        "信阳银行" => "139",
        "浙江稠州商银" => "025",
        "浙江稠州商业银行" => "128",
        "浙江民泰商业银行" => "093",
        "无锡农村商业银行" => "047",
        "南阳村镇银行" => "272",
        "阳谷沪农商村镇银行" => "273",
        "延吉和润村镇银行" => "274",
        "鞍山银行" => "095",
        "中银富登村镇银行" => "312",
        "中银富登村镇银行股份有限公司" => "313",
        "衡水银行" => "064",
        "平顶山银行" => "057",
        "六盘水商行" => "325",
        "内蒙古省农村信用社联合社" => "326",
        "内蒙古省农村信用社" => "326",
        "内蒙古省农信" => "326",
        "内蒙古农村信用社联合社" => "326",
        "内蒙古农村信用社" => "326",
        "内蒙古农信" => "326",
        "内蒙古银行" => "147",
        "惠水恒升村镇银行" => "522",
        "朝阳银行" => "048",
        "江西农商银行" => "214",
        "江西农商" => "214",
        "枣庄农商银行" => "260",
        "贵阳农商银行" => "469",
        "贵阳农商" => "469",
        "泉州银行" => "462",
        "安图农商村镇银行" => "380",
        "融兴村镇银行" => "568",
        "宁波通商银行" => "275",
        "宁波东海银行" => "347",
        "龙井农村信用社" => "277",
        "天津宁河村镇银行" => "327",
        "广州增城长江村镇银行" => "307",
        "鄞州银行" => "171",
        "海丰农商银行" => "495",
        "上饶银行" => "151",
        "黄梅农村商业银行" => "539",
        "安顺银行" => "381",
        //"黄梅农商银行" => "539",
        //"黄梅农商" => "539",
        "密山农商银行" => "507",
        "密山农商" => "507",
        "义乌联合村镇银行" => "291",
        "广东普宁汇成村镇银行" => "303",
        "广州白云民泰村镇银行" => "304",
        "浙江诸暨联合村镇银行" => "492",
        "东阳农商银行" => "340",
        "东阳农村商业银行" => "340",
        "日照沪农商村镇银行" => "337",
        "沪农商村镇银行" => "267",
        "浙江农商银行" => "491",
        "鄂尔多斯银行" => "137",
        "永州农村商业银行" => "353",
        "潮州农商银行" => "561",
        "义乌农商银行" => "290",
        "义乌农商" => "290",
        "永隆银行" => "354",
        "海口联合农商银行" => "494",
        "海口联合农商" => "494",
        "瑞丰银行" => "547",
        "玉泉蒙银村镇银行" => "355",
        "江西赣州银座村镇银行" => "389",
        "南海省农村信用社联合社" => "156",
        "南海省农村信用社" => "156",
        "南海省农信" => "156",
        "南海农村信用社联合社" => "156",
        "南海农村信用社" => "156",
        "南海农信" => "156",
        "南海农村信用联社" => "156",
        "新乡银行" => "157",
        "山西银行" => "257",
        "盘锦市商业银行" => "518",
        "盘锦银行" => "518",
        "安徽庐江农村商业银行" => "233",
        "庐江惠民村镇银行" => "234",
        "东山润鑫村镇银行" => "338",
        "东方惠丰村镇银行" => "339",
        "青田农商银行" => "444",
        "河北省农村信用社联合社" => "244",
        "河北省农村信用社" => "244",
        "河北省农信" => "244",
        "河北农村信用社联合社" => "244",
        "河北农村信用社" => "244",
        "河北农信" => "244",
        "清远农商银行" => "245",
        "长春南关惠民村镇银行" => "246",
        "海峡银行" => "498",
        "四川银行" => "346",
        "安徽怀远农商行" => "382",
        "新疆省农村信用社联合社" => "271",
        "新疆省农村信用社" => "271",
        "新疆省农信" => "271",
        "新疆农村信用社联合社" => "271",
        "新疆农村信用社" => "271",
        "新疆农信" => "271",
        "长春二道农商村镇银行" => "366",
        "长春经开融丰村镇银行" => "367",
        "庄河汇通村镇银行" => "384",
        "昆山省农信社联合社" => "421",
        "昆山省农信社" => "421",
        "昆山省农信" => "421",
        "昆山农信社联合社" => "421",
        "昆山农信社" => "421",
        "昆山农信" => "421",
        "梁山农商银行" => "510",
        "乌鲁木齐商业银行" => "315",
        "乌鲁木齐市商业银行" => "166",
        "乌鲁木齐银行股份有限公司" => "316",
        "宁波鄞州农村合作银行" => "348",
        "垦利乐安村镇银行股份有限公司" => "455",
        "德州银行" => "150",
        "长春南关惠民村镇银行有限责任公司" => "368",
        "长春绿园融泰村镇银行股份有限公司" => "369",
        "长春朝阳和润村镇银行" => "370",
        "长葛轩辕村镇银行" => "371",
        //"苏州农村商业银行" => "286",
        "新疆银行" => "546",
        "无为徽银村镇银行" => "336",
        "西藏银行" => "399",
        "渣打银行" => "181",
        "花旗银行" => "182",
        "德意志银行" => "183",
        "瑞士银行" => "184",
        "荷兰银行" => "185",
        "香港花旗" => "187",
        "香港东亚银行" => "188",
        "恒生银行" => "189",
        "大丰银行" => "292",
        "大华银行" => "293",
        "大华银行有限公司" => "294",
        "大同市南郊区东都村镇银行有限责任公司" => "295",
        "大同银行股份有限公司" => "296",
        "大连开发区鑫汇村镇银行" => "297",
        "文昌大众村镇银行" => "335",
        "汇丰银行" => "180",
        "支付宝" => "200",
        "云和联合村镇银行" => "317",
        "云霄润发村镇银行" => "321",
        "五峰金谷村镇银行" => "322",
        "创兴银行" => "375",
        "华瑞银行" => "376",
        "吉林洮北惠民村镇银行" => "377",
        //"微信" => "",
        //"微信固码" => "",
        //"海口联合农村商业银行" => "494",
        //"海口联合农商银行" => "494",
        //"海口联合农商" => "494",
        "曲靖市商业银行" => "387",
        "农业发展银行" => "374",
        "云南红塔银行" => "319",
        "云南红塔银行股份有限公司" => "320",
        "广东南粤" => "060",
        "广东南粤银行" => "060",
        "顺德农村商业银行" => "475",
        "南海农村商业银行" => "452",
        "南海农商银行" => "452",
        "南海农商" => "452",
        "广东华兴银行" => "222",
        "湛江农村商业银行" => "532",
        "湛江农商银行" => "532",
        "湛江农商" => "532",
        "邯郸市商业银行" => "441",
        "厦门国际银行" => "202",
        "黔西花都村镇银行" => "571",
        "福建石狮农村商业银行" => "555",
        "福建石狮农商银行" => "555",
        "福建石狮农商" => "555",
        "泉州农村商业银行" => "461",
        "泉州农商银行" => "461",
        "泉州农商" => "461",
        "扬州银行" => "386",
        "成都商业银行" => "385",
        "杭州联合银行" => "270",
        "浙江三门银座村镇银行" => "485",
        "富邦华一银行" => "024",
        "尧都农商行" => "078",
        "萧山农村商业银行" => "536",
        "萧山农商银行" => "536",
        "缙云联合村镇银行" => "548",
        "三门峡银行" => "118",
        "长兴联合村镇银行" => "361",
        "福泉富民村镇银行" => "557",
        "汪清和润村镇银行" => "249",
        "昆山农村商业银行" => "096",
        "玉溪市商业银行" => "097",
        "玉溪银行" => "356",
        "淮安农村商业银行" => "513",
        "淮安农商银行" => "513",
        "淮安农商" => "513",
        "新华村镇银行" => "542",
        "湖南三湘银行" => "528",
        "成都银行" => "141",
        "遂宁银行" => "551",
        "陕西信合" => "101",
        "湖南茶陵农村商业银行" => "227",
        "湖南茶陵浦发村镇银行" => "231",
        "浦发村镇银行" => "232",
        "江苏沐阳农村商业银行" => "250",
        "临川浦发村镇银行" => "251",
        "长城华西银行" => "365",
        "日照银行" => "261",
        "齐商银行" => "145",
        "潍坊银行" => "122",
        "中山小榄村镇银行" => "167",
        "辽宁省农村信用社联合社" => "207",
        "辽宁省农村信用社" => "207",
        "辽宁省农信" => "207",
        "辽宁农村信用社联合社" => "207",
        "辽宁农村信用社" => "207",
        "辽宁农信" => "207",
        "辽沈银行" => "403",
        //"中旅银行" => "",
        "陕西省农村信用社联合社" => "258",
        "陕西省农村信用社" => "258",
        "陕西省农信" => "258",
        "陕西农村信用社联合社" => "258",
        "陕西农村信用社" => "258",
        "陕西农信" => "258",
        "其他农村信用社" => "259",
        "晋商银行" => "126",
        "长治银行" => "364",
        "山西孝义农村商业银行" => "302",
        "山西孝义农商银行" => "302",
        "山西孝义农商" => "302",
        "孝义汇通村镇银行" => "407",
        "东营莱商村镇银行" => "193",
        "东营市商业银行" => "136",
        "泸州银行" => "434",
        "皖南农村商业银行" => "534",
        "皖南农商银行" => "534",
        "皖南农商" => "534",
        "山东农村商业银行" => "228",
        "山东农商银行" => "228",
        "山东农商" => "228",
        "福州农村商业银行" => "554",
        "福州农商银行" => "554",
        "福州农商" => "554",
        "湖州银行" => "527",
        "星展银行" => "230",
        "湖州市商业银行" => "155",
        "冠县齐丰村镇银行" => "579",
        "攀枝花银行" => "577",
        "鹰潭月湖恒通村镇银行" => "576",
        "襄城汇浦村镇银行" => "575",
        "襄垣县融汇村镇银行有限责任公司" => "574",
        "襄汾县万都村镇银行有限责任公司" => "573",
        "濮阳银行" => "572",
        "遵义银行" => "570",
        "遵义长征村镇银行" => "569",
        "澳门银行" => "567",
        "鞍山银行有限公司" => "565",
        "镇江银行" => "563",
        "蔚县银泰村镇银行" => "562",
        "德惠敦银村镇银行" => "560",
        "蒙古郭勒姆特银行" => "558",
        "漯河商行" => "553",
        "锦州银行有限公司" => "552",
        "葫芦岛银行" => "550",
        "营口沿海银行" => "549",
        "新疆汇和银行股份有限公司" => "545",
        "新泰齐丰村镇银行" => "544",
        "新绛新田村镇银行" => "543",
        "新乡新兴村镇银行" => "541",
        "集友银行" => "538",
        "雅安市商业银行" => "537",
        "焦作银行" => "533",
        "湖南银行" => "531",
        "湖南桂阳农村商业银行" => "530",
        "湖北农村信用社有限公司" => "526",
        "温州民商银行股份有限公司" => "525",
        "温州民商银行" => "247",
        "朝阳柳城村镇银行" => "524",
        "景德镇银行" => "523",
        "银座村镇银行" => "521",
        "莆田农商银行" => "520",
        "深圳宝安桂银村镇银行" => "516",
        "深圳发展银行" => "515",
        "淮安银行" => "514",
        "淮北银行" => "512",
        "梅州客商银行" => "511",
        "常州银行" => "509",
        "尉氏合益村镇银行" => "508",
        "商丘商行" => "506",
        "铁岭新星村镇银行" => "505",
        "铁岭银行股份有限公司" => "504",
        "调兵山惠民村镇银行" => "503",
        "荥阳利丰村镇银行股份有限公司" => "502",
        "盐城银行" => "501",
        "珠海华润银行股份有限公司" => "500",
        "华润银行" => "218",
        "珠海市农商银行" => "499",
        "海南屯昌长江村镇银行" => "496",
        "浙江萧山湖商村镇银行股份有限公司" => "493",
        "浙江农村信用合作社" => "489",
        "浙江长兴联合村镇银行股份有限公司" => "488",
        "浙江民泰商业银行股份有限公司" => "487",
        "浙江天台民生村镇银行" => "486",
        "徐州银行" => "480",
        "夏津胶东村镇银行" => "479",
        "凉山州银行" => "477",
        "香河益民村镇银行股份有限公司" => "476",
        "钟山凉都村镇银行" => "474",
        "重庆富民银行股份有限公司" => "473",
        "重庆农商" => "472",
        "重庆三峡银行股份有限公司" => "471",
        "重庆九龙坡民泰村镇银行" => "470",
        "范县德商村镇银行" => "468",
        "禹城胶东村镇银行" => "467",
        "禹州新民生村镇银行" => "466",
        "济南槐荫沪农商村镇银行" => "465",
        "济南银行" => "464",
        "济宁儒商村镇银行" => "463",
        "柘城黄淮村镇银行" => "460",
        "宣化家银村镇银行" => "459",
        "客家村镇银行" => "458",
        "威海蓝海银行" => "457",
        "哈密银行" => "454",
        "南通银行" => "453",
        "南洋商业银行" => "450",
        "信阳平桥中原村镇银行" => "449",
        "保德慧融村镇银行" => "448",
        "临沂银行" => "447",
        "阜新市银行" => "443",
        "金寨徽银村镇银行有限公司" => "442",
        "连江恒欣村镇银行" => "440",
        "远安金谷村镇银行" => "439",
        "芝罘齐丰村镇银行" => "438",
        "芜湖银行" => "437",
        "芜湖泰寿村镇银行" => "436",
        "罗平兴福村镇银行" => "435",
        "沾化青云村镇银行" => "433",
        "村镇银行" => "410",
        "河南农商银行" => "432",
        "河北农村商业银行" => "431",
        "河北农村信用联合社" => "430",
        "武强家银村镇银行" => "429",
        "武城圆融村镇银行" => "428",
        "武安村镇银行" => "427",
        "武乡县泽都村镇银行有限责任公司" => "426",
        "武义农商银行" => "425",
        "昌黎家银村镇银行" => "424",
        "昌乐乐安村镇银行" => "423",
        "昆明市农村信用合作社联合社" => "422",
        "岫岩金玉村镇银行" => "420",
        "宝丰豫丰村镇银行" => "419",
        "宜昌银行" => "418",
        "宜良融丰村镇银行" => "417",
        "图们敦银村镇银行" => "416",
        "阳城三禾村镇银行" => "414",
        "阳光村镇银行" => "413",
        "赤城家银村镇银行" => "411",

    ];

    /*   代收   */
    public function sendDeposit($data)
    {
        $this->key = $data['key'];

        $math = new BCMathUtil;
        $postBody = [
            'version' => '1.6',
            'cid' => $data['merchant'] ?? $this->merchant,
            'tradeNo' => $data['request']->order_number,
            'payType' => $this->channelCodeMap[$this->channelCode],
            'amount' => $math->mul($data['request']->amount, 100, 0),   // 金額單位是分
            'notifyUrl' => $data['callback_url'],
            'returnType' => 0,
            'requestTime' => now()->format('YmdHis')
        ];

        if (isset($data['request']->real_name) && $data['request']->real_name != '') {
            $postBody['acctName'] = $data['request']->real_name;
        }

        $sign = $this->makesign($postBody, $this->key);

        $postBody['Sign'] = $sign;

        try {
            $client = new \GuzzleHttp\Client();
            $response = $client->request('POST', $data['url'], [
                'form_params' => $postBody
            ]);
            $row = json_decode($response->getBody(), true);
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'postBody', 'message'));
            return ['success' => false];
        }

        Log::debug(self::class, compact('data', 'postBody', 'row'));

        if (isset($row['retcode']) && in_array($row['retcode'], [0])) {
            $ret = [
                'order_number' => $data['request']->order_number,
                'amount' => $data['request']->amount,
                'receiver_name' => $row['payeeName'],
                'receiver_bank_name' => $row['payeeBankName'],
                'receiver_account' => $row['payeeAcctNo'],
                'receiver_bank_branch' => $row['branchName'],
                'pay_url'   => $row['link'],
                'created_at' => date('Y-m-d H:i:s'),
            ];
            return ['success' => true, 'data' => $ret];
        } else {
            return ['success' => false, "msg" => $row["retmsg"] ?? ""];
        }
    }

    public function queryDeposit($data)
    {
        return ['success' => true, 'msg' => '原因'];
    }

    /*   代付   */
    public function sendDaifu($data)
    {
        $this->key = $data['key'];

        if (!isset($this->bankMap[$data['request']->bank_name])) {
            return ['success' => false, 'msg' => '不支持此银行代付，请联系客服'];
        }

        $math = new BCMathUtil;
        $postBody = [
            'version' => '1.0',
            'cid' => $data['merchant'] ?? $this->merchant,
            'tradeNo' => $data['request']->order_number,
            'amount' => $math->mul($data['request']->amount, 100, 0),
            'bankCode' => $this->bankMap[$data['request']->bank_name],
            'acctNo' => $data['request']->bank_card_number,
            'acctName' => $data['request']->bank_card_holder_name,
            'notifyUrl' => $data['callback_url'],
            'payType' => 1,
        ];

        $sign = $this->makesign($postBody);

        $postBody['sign'] = $sign;

        try {
            $client = new \GuzzleHttp\Client();
            $response = $client->request('POST', $data['url'], [
                'form_params' => $postBody
            ]);
            $row = json_decode($response->getBody(), true);
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'postBody', 'message'));
            return ['success' => true];
        }

        Log::debug(self::class, compact('data', 'postBody', 'row'));

        if (isset($row['retcode']) && in_array($row['retcode'], [0])) {
            return ['success' => true];
        }

        return ['success' => false, "msg" => $row["retmsg"] ?? ""];
    }

    public function queryDaifu($data)
    {
        $this->key = $data['key'];

        $postBody = [
            'tradeNo' => $data['request']->order_number,
            'cid' => $data['merchant'] ?? $this->merchant,
            'type' => '001'
        ];

        $sign = $this->makesign($postBody);

        $postBody['sign'] = $sign;

        try {
            $client = new \GuzzleHttp\Client();
            $response = $client->request('POST', $data['queryDaifuUrl'], [
                'form_params' => $postBody
            ]);
            $row = json_decode($response->getBody(), true);
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'postBody', 'message'));
            return ['success' => false, 'status' => Transaction::STATUS_PAYING];
        }

        Log::debug(self::class, compact('data', 'postBody', 'response'));

        if (isset($row['retcode']) && in_array($row['retcode'], [0])) {
            return ['success' => true, 'status' => Transaction::STATUS_PAYING];
        }

        return ['success' => false, 'status' => Transaction::STATUS_PAYING];
    }

    /*   回调 => callback($request,訂單資料)   */
    public function callback($request, $transaction)
    {
        $data = $request->all();

        $math = new BCMathUtil;

        if ($data['tradeNo'] != $transaction->order_number) {
            return ['error' => '订单编号不正确'];
        }

        //代收檢查金額
        if (isset($data['amount']) && $data['amount'] != $math->mul($transaction->amount, 100, 0)) {
            return ['error' => '金额不正确'];
        }

        //檢查狀態，成功
        if (isset($data['status']) && in_array($data['status'], [1])) {
            return ['success' => true];
        }

        //檢查狀態，失敗
        if (isset($data['status']) && !in_array($data['status'], [3])) {
            return ['fail' => '逾時'];
        }

        return ['error' => '未知错误'];
    }

    public function queryBalance($data)
    {
        $this->key = $data['key'];
        $post_data = [
            'cid'   => $data['merchant']
        ];

        $post_data['sign'] = $this->makesign($post_data);

        try {
            $client = new \GuzzleHttp\Client();
            $response = $client->request('POST', $data['queryBalanceUrl'], [
                'json' => $post_data
            ]);
            $result = json_decode($response->getBody(), true);
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'post_data', 'message'));
            return 0;
        }

        // Log::debug(self::class, compact('data', 'post_data', 'result'));

        if (isset($result['retcode']) && in_array($result['retcode'], [0])) {
            $balance = $result['balancePay'];

            ThirdChannelModel::where('id', $data['thirdchannelId'])->update(['balance' => $balance]);

            return $balance;
        } else {
            return 0;
        }
    }

    public function makesign($data)
    {
        ksort($data);
        $signstr = '';
        foreach ($data as $k => $v) {
            $signstr .= "$k=$v&";
        }
        $signstr .= "key=$this->key";
        return md5($signstr);
    }
}
