<?php

namespace App\ThirdChannel;

use App\Model\Channel;
use App\Model\Transaction;
use App\Model\ThirdChannel as ThirdChannelModel;
use Exception;
use Illuminate\Support\Facades\Log;
use GuzzleHttp\Exception\RequestException;
use GuzzleHttp\Client;

class Juice extends ThirdChannel
{
    //Log名称
    public $log_name   = 'Juice';
    public $type    = 1; //1:代收付 2:纯代收 3:纯代付－

    //回调地址
    public $notify    = '';
    public $depositUrl   = 'https://api.fordmllnjui.com/deposit/order';
    public $xiafaUrl   = '';
    public $daifuUrl   = 'https://api.fordmllnjui.com/withdraw/order';
    public $queryDepositUrl    = '';
    public $queryDaifuUrl  = 'https://api.fordmllnjui.com/withdraw/order/query';
    public $queryBalanceUrl = 'https://api.fordmllnjui.com/merchant/balance';

    //默认商户号
    public $merchant    = '';

    //默认密钥
    public $key          = '';
    public $key2         = '';

    //回传字串
    public $success = 'SUCCESS';

    //白名单
    public $whiteIP = ['34.92.161.2'];

    public $channelCodeMap = [
        Channel::CODE_BANK_CARD => "BankToBank",
    ];

    public $bankMap = [
        "中国⼯商银⾏" => "001",
        "工商银行" => "001",
        "招商银行" => "006",
        "中国建设银行" => "002",
        "中国建设" => "002",
        "建设银行" => "002",
        "中国银行" => "003",
        "中国银⾏" => "003",
        "中国农业银行" => "004",
        "中国农业" => "004",
        "农业银行" => "004",
        "交通银行" => "005",
        "广发银行" => "018",
        "中国光大银行" => "012",
        "光大银行" => "012",
        "兴业银行" => "011",
        "平安银行" => "013",
        "中国民生银行" => "009",
        "民生银行" => "009",
        "华夏银行" => "014",
        "中国邮政储蓄银行" => "007",
        "邮政银行" => "007",
        "中国邮政" => "007",
        "宁波银行" => "019",
        "北京银行" => "015",
        "浙商银行" => "049",
        "广州银行" => "099",
        "长沙银行" => "168",
        "广西北部湾银行" => "041",
        "桂林银行" => "102",
        "东莞银行" => "051",
        "杭州银行" => "063",
        "江苏银行" => "017",
        "广西农信银行" => "308",
        "吉林银行" => "120",
        "南京银行" => "028",
        "恒丰银行" => "070",
        "深圳农商银行" => "032",
        "深圳农商" => "032",
        "深圳农村商业银行" => "032",
        "中信银行" => "008",
        "武汉农商银行" => "084",
        "威海银行" => "456",
        "上海银行" => "016",
        "哈尔滨银行" => "191",
        "青岛银行" => "105",
        "莱商银行" => "077",
        "齐鲁银行" => "110",
        "烟台银行" => "223",
        "柳州银行" => "192",
        "重庆农村商业银行" => "148",
        "重庆农商银行" => "148",
        "重庆农商" => "148",
        "北京商业银行" => "345",
        "北京商银" => "345",
        "甘肃省农村信用社" => "163",
        "甘肃省农村信用社联合社" => "163",
        "甘肃省农信" => "163",
        "甘肃农村信用社联合社" => "163",
        "甘肃农村信用社" => "163",
        "甘肃农信" => "163",
        "湖北银行" => "065",
        "东莞农村商业银行" => "098",
        "东莞农村银行" => "098",
        "东莞农商银行" => "098",
        "东莞农商" => "098",
        "湖南省农村信用社联合社" => "135",
        "湖南省农村信用社" => "135",
        "湖南省农信" => "135",
        "湖南农村信用社联合社" => "135",
        "湖南农村信用社" => "135",
        "湖南农信" => "135",
        "泰隆银行" => "241",
        "稠州银行" => "025",
        "自贡银行" => "395",
        "民泰商业银行" => "093",
        "民泰商银" => "093",
        "银座村镇银行" => "521",
        "营口银行" => "100",
        "兰州银行" => "125",
        "临商银行" => "172",
        "江西银行" => "215",
        //"江西农村信用社" => "",
        //"江西省农村信用社联合社" => "",
        //"江西省农信" => "",
        //"江西农村信用社联合社" => "",
        //"江西农信" => "",
        "江苏省农村信用社联合社" => "080",
        "江苏省农村信用社" => "080",
        "江苏省农信" => "080",
        "江苏农村信用社联合社" => "080",
        "江苏农村信用社" => "080",
        "江苏农信" => "080",
        "华融湘江银行" => "067",
        "大连银行" => "035",
        "沧州银行" => "279",
        "重庆三峡银行" => "079",
        "东营银行" => "264",
        "广东农信" => "211",
        "广东农村信用社" => "211",
        "广东农村信用社联合社" => "211",
        "广东省农信" => "211",
        "广东省农村信用社" => "211",
        "广东省农村信用社联合社" => "211",
        "广州农商" => "061",
        "广州农村商业银行" => "061",
        "广州农商银行" => "061",
        "广州省农村商业银行" => "061",
        "广州省农商银行" => "061",
        "广州省农商" => "061",
        "蒙商银行" => "559",
        //"长春融丰" => "",
        "保定银行" => "196",
        "重庆银行" => "115",
        "张家口银行" => "265",
        "天津银行" => "176",
        "邯郸银行" => "050",
        "富滇银行" => "036",
        "徽商银行" => "090",
        "承德银行" => "173",
        "阳光村镇银行" => "413",
        "阜新银行" => "083",
        "赣州银行" => "113",
        "乐山商业银行" => "341",
        "珠海华润银行" => "224",
        "顺德农商银行" => "046",
        "顺德农商" => "046",
        "成都农村商业银行" => "104",
        "成都农商银行" => "104",
        "成都农商" => "104",
        "上海农村商业银行" => "242",
        "上海农商银行" => "242",
        "上海农商" => "242",
        "盛京银行" => "130",
        "福建海峡银行" => "027",
        "郑州银行" => "034",
        "上海浦东发展银行" => "010",
        "浦发银行" => "010",
        "厦门银行" => "026",
        "浙江省农村信用社联合社" => "124",
        "浙江省农村信用社" => "124",
        "浙江省农信" => "124",
        "浙江农村信用社联合社" => "124",
        "浙江农村信用社" => "124",
        "浙江农信" => "124",
        //"南宁江南国民村镇银行" => "",
        "江南村镇银行" => "394",
        "山东省农村信用社联合社" => "174",
        "山东省农村信用社" => "174",
        "山东省农信" => "174",
        "山东农村信用社联合社" => "174",
        "山东农村信用社" => "174",
        "山东农信" => "174",
        "中原银行" => "030",
        "乐山市商业银行" => "152",
        "河南省农村信用社" => "031",
        "河南省农村信用社联合社" => "031",
        "河南省农信" => "031",
        "河南农村信用社联合社" => "031",
        "河南农村信用社" => "031",
        "河南农信" => "031",
        "四川天府银行" => "194",
        "广西壮族自治区农村信用社联合社" => "040",
        "广西壮族自治区农村信用社" => "040",
        "广西壮族自治区农信" => "040",
        "广西壮族自治区信用社联合社" => "040",
        "广西壮族自治区信用社" => "040",
        "广西农村信用社" => "040",
        "广西农村信用社联合社" => "040",
        "广西农信" => "040",
        "广西农信银行" => "308",
        "福建省农村信用社联合社" => "556",
        "福建省农村信用社" => "556",
        "福建省农信社" => "556",
        "福建省农信" => "556",
        "福建农村信用社联合社" => "556",
        "福建农村信用社" => "556",
        "福建农信社" => "556",
        "福建农信" => "556",
        "湖北省农村信用社" => "037",
        "湖北省农信社" => "037",
        "湖北省农信" => "037",
        "湖北农村信用社" => "037",
        "湖北农信社" => "037",
        "湖北农信" => "037",
        "晋中银行" => "481",
        "晋城银行" => "082",
        "银座银行" => "521",
        "安徽省农村信用社联合社" => "162",
        "安徽省农村信用社" => "162",
        "安徽省农信" => "162",
        "安徽农村信用社联合社" => "162",
        "安徽农村信用社" => "162",
        "安徽农信" => "162",
        // "河南伊川农商银行" => "",
        "四川省农村信用社" => "075",
        "四川省农信社" => "075",
        "四川省农信" => "075",
        "四川农村信用社" => "075",
        "四川农信社" => "075",
        "四川农信" => "075",
        // "珠海市农村信用社" => "",
        "云南省农村信用社联合社" => "159",
        "云南省农村信用社" => "159",
        "云南省农信" => "159",
        "云南农村信用社联合社" => "159",
        "云南农村信用社" => "159",
        "云南农信" => "159",
        "珠海农商银行" => "499",
        "青岛农商银行" => "445",
        "青岛农商" => "445",
        "常熟农商银行" => "278",
        "常熟农商" => "278",
        "汉口银行" => "058",
        "江南农村商业银行" => "393",
        "江南农商" => "393",
        "九江银行" => "091",
        "洛阳银行" => "143",
        "深圳前海微众银行" => "517",
        "苏州银行" => "062",
        "台州银行" => "086",
        "微商银行" => "540",
        "温州银行" => "108",
        "萧山农商银行" => "536",
        "萧山农商" => "536",
        "长沙农商银行" => "363",
        "长沙农商" => "363",
        "紫金农商银行" => "535",
        "紫金农商" => "535",
        "渤海银行" => "127",
        "龙江银行" => "116",
        "黑龙江省农村信用社联合社" => "225",
        "黑龙江省农村信用社" => "225",
        "黑龙江省农信" => "225",
        "黑龙江农村信用社联合社" => "225",
        "黑龙江农村信用社" => "225",
        "黑龙江农信" => "225",
        "辽阳银行" => "404",
        "丹东银行" => "068",
        "大连农商银行" => "298",
        "大连农商" => "298",
        "甘肃银行" => "358",
        "贵阳银行" => "205",
        "贵州银行" => "206",
        "桂林国民银行" => "482",
        "济宁银行" => "081",
        "廊坊银行" => "094",
        "长安银行" => "203",
        "西安银行" => "131",
        "包商银行" => "132",
        "本溪银行" => "350",
        "达州银行" => "412",
        "东亚银行" => "106",
        "抚顺银行" => "133",
        "贵州省农村信用社联合社" => "054",
        "贵州省农村信用社" => "054",
        "贵州省农信" => "054",
        "贵州农村信用社联合社" => "054",
        "贵州农村信用社" => "054",
        "贵州农信" => "054",
        "河北银行" => "170",
        "吉林农信银行" => "165",
        "吉林省农村信用社联合社" => "165",
        "吉林省农村信用社" => "165",
        "吉林省农信" => "165",
        "吉林农村信用社联合社" => "165",
        "吉林农村信用社" => "165",
        "吉林农信" => "165",
        "江苏农商银行" => "391",
        "江苏农商" => "391",
        "金华银行" => "169",
        "锦州银行" => "056",
        "昆仑银行" => "076",
        "昆山农商银行" => "021",
        "昆山农商" => "021",
        "青海省农村信用社联合社" => "446",
        "青海省农村信用社" => "446",
        "青海省农信" => "446",
        "青海农村信用社联合社" => "446",
        "青海农村信用社" => "446",
        "青海农信" => "446",
        "上虞农商银行" => "252",
        "上虞农商" => "252",
        "绍兴银行" => "053",
        "太仓农商银行" => "331",
        "太仓农商" => "331",
        "泰安银行" => "484",
        "天津农商银行" => "109",
        "天津农商" => "109",
        "邢台银行" => "134",
        "张家港农村商业银行" => "123",
        "张家港农商银行" => "123",
        "张家港农商" => "123",
        "长江商业银行" => "362",
        "长江商银" => "362",
        "绵阳商业银行" => "519",
        "绵阳商银" => "519",
        "山西省农村信用社联合社" => "254",
        "山西省农村信用社" => "254",
        "山西省农信" => "254",
        "山西农村信用社联合社" => "254",
        "山西农村信用社" => "254",
        "山西农信" => "254",
        "阳泉商业银行" => "415",
        "桦甸惠民村镇银行" => "483",
        "海南省农村信用社联合社" => "497",
        "海南省农村信用社" => "497",
        "海南省农信" => "497",
        "海南农村信用社联合社" => "497",
        "海南农村信用社" => "497",
        "海南农信" => "497",
        "黄河农信银行" => "226",
        "黄河农村信用社联合社" => "226",
        "黄河农村信用社" => "226",
        "黄河农信" => "226",
        "江门农商银行" => "388",
        "江门农商" => "388",
        "宁夏银行" => "089",
        "宁夏黄河农村商业银行" => "059",
        "宁夏黄河农商" => "059",
        "深圳福田银座村镇银行" => "235",
        "石嘴山银行" => "149",
        "苏州农商银行" => "263",
        "苏州农商" => "263",
        "天津滨海农村商业银行" => "328",
        "天津滨海农商" => "328",
        "枣庄银行" => "285",
        "浙江网商银行" => "039",
        "浙江网商" => "039",
        //"广东农商银行" => "",
        //"广东农商" => "",
        "海南银行" => "209",
        "五常惠民村镇银行" => "323",
        "唐山银行" => "478",
        "北京农村商业银行" => "138",
        "北京农商银行" => "138",
        "北京农商" => "138",
        "南阳村镇银行" => "272",
        "鞍山银行" => "564",
        "中银富登村镇银行" => "312",
        "衡水银行" => "064",
        "平顶山银行" => "057",
        "内蒙古省农村信用社联合社" => "326",
        "内蒙古省农村信用社" => "326",
        "内蒙古省农信" => "326",
        "内蒙古农村信用社联合社" => "326",
        "内蒙古农村信用社" => "326",
        "内蒙古农信" => "326",
        "内蒙古银行" => "147",
        "惠水恒升村镇银行" => "522",
        "朝阳银行" => "048",
        "江西农商银行" => "214",
        "江西农商" => "214",
        "贵阳农商银行" => "469",
        "贵阳农商" => "469",
        "泉州银行" => "462",
        "安图农商村镇银行" => "380",
        "融兴村镇银行" => "568",
        "宁波通商银行" => "275",
        "天津宁河村镇银行" => "327",
        "广州增城长江村镇银行" => "307",
        "鄞州银行" => "171",
        "海丰农商银行" => "495",
        "上饶银行" => "151",
        "黄梅农村商业银行" => "539",
        "黄梅农商银行" => "539",
        "黄梅农商" => "539",
        "密山农商银行" => "507",
        "密山农商" => "507",
        "义乌联合村镇银行" => "291",
        "广东普宁汇成村镇银行" => "303",
        "浙江诸暨联合村镇银行" => "492",
        "东阳农商银行" => "340",
        "东阳农村商业银行" => "340",
        "日照沪农商村镇银行" => "337",
        "浙江农商银行" => "491",
        "鄂尔多斯银行" => "137",
        "永州农村商业银行" => "353",
        "潮州农商银行" => "561",
        "义乌农商银行" => "290",
        "义乌农商" => "290",
        "海口联合农商银行" => "494",
        "海口联合农商" => "494",
        "瑞丰银行" => "547",
        "南海省农村信用社联合社" => "451",
        "南海省农村信用社" => "451",
        "南海省农信" => "451",
        "南海农村信用社联合社" => "451",
        "南海农村信用社" => "451",
        "南海农信" => "451",
        "山西银行" => "257",
        "盘锦市商业银行" => "518",
        "盘锦银行" => "518",
        "青田农商银行" => "444",
        "河北省农村信用社联合社" => "244",
        "河北省农村信用社" => "244",
        "河北省农信" => "244",
        "河北农村信用社联合社" => "244",
        "河北农村信用社" => "244",
        "河北农信" => "244",
        "海峡银行" => "498",
        "四川银行" => "346",
        "安徽怀远农商行" => "382",
        "新疆省农村信用社联合社" => "271",
        "新疆省农村信用社" => "271",
        "新疆省农信" => "271",
        "新疆农村信用社联合社" => "271",
        "新疆农村信用社" => "271",
        "新疆农信" => "271",
        "长春二道农商村镇银行" => "366",
        "昆山省农信社联合社" => "421",
        "昆山省农信社" => "421",
        "昆山省农信" => "421",
        "昆山农信社联合社" => "421",
        "昆山农信社" => "421",
        "昆山农信" => "421",
        "梁山农商银行" => "510",
        "乌鲁木齐商业银行" => "315",
        "宁波鄞州农村合作银行" => "348",
        "垦利乐安村镇银行股份有限公司" => "455",
        "德州银行" => "150",
        "苏州农村商业银行" => "286",
        "新疆银行" => "546",
        "西藏银行" => "399",
        "渣打银行" => "181",
        "文昌大众村镇银行" => "335",
        "汇丰银行" => "180",
        "支付宝" => "200",
        //"微信" => "",
        //"微信固码" => "",
        "海口联合农村商业银行" => "494",
        "海口联合农商银行" => "494",
        "海口联合农商" => "494",
        "曲靖市商业银行" => "387",
        "农业发展银行" => "374",
        "云南红塔银行" => "319",
        "广东南粤" => "060",
        "广东南粤银行" => "060",
        "顺德农村商业银行" => "475",
        "南海农村商业银行" => "452",
        "南海农商银行" => "452",
        "南海农商" => "452",
        "广东华兴银行" => "222",
        "湛江农村商业银行" => "532",
        "湛江农商银行" => "532",
        "湛江农商" => "532",
        "邯郸市商业银行" => "441",
        "厦门国际银行" => "202",
        "黔西花都村镇银行" => "571",
        "福建石狮农村商业银行" => "555",
        "福建石狮农商银行" => "555",
        "福建石狮农商" => "555",
        "泉州农村商业银行" => "461",
        "泉州农商银行" => "461",
        "泉州农商" => "461",
        "杭州联合银行" => "270",
        "浙江三门银座村镇银行" => "485",
        "富邦华一银行" => "024",
        "萧山农村商业银行" => "536",
        "萧山农商银行" => "536",
        "缙云联合村镇银行" => "548",
        "长兴联合村镇银行" => "361",
        "福泉富民村镇银行" => "557",
        "汪清和润村镇银行" => "249",
        "昆山农村商业银行" => "096",
        "淮安农村商业银行" => "513",
        "淮安农商银行" => "513",
        "淮安农商" => "513",
        "新华村镇银行" => "542",
        "湖南三湘银行" => "528",
        "成都银行" => "141",
        "遂宁银行" => "551",
        "长城华西银行" => "365",
        "日照银行" => "261",
        "齐商银行" => "145",
        "潍坊银行" => "122",
        "辽宁省农村信用社联合社" => "207",
        "辽宁省农村信用社" => "207",
        "辽宁省农信" => "207",
        "辽宁农村信用社联合社" => "207",
        "辽宁农村信用社" => "207",
        "辽宁农信" => "207",
        //"中旅银行" => "",
        "陕西省农村信用社联合社" => "258",
        "陕西省农村信用社" => "258",
        "陕西省农信" => "258",
        "陕西农村信用社联合社" => "258",
        "陕西农村信用社" => "258",
        "陕西农信" => "258",
        "晋商银行" => "126",
        "长治银行" => "364",
        "山西孝义农村商业银行" => "302",
        "山西孝义农商银行" => "302",
        "山西孝义农商" => "302",
        "孝义汇通村镇银行" => "407",
        "东营莱商村镇银行" => "193",
        "泸州银行" => "434",
        "皖南农村商业银行" => "534",
        "皖南农商银行" => "534",
        "皖南农商" => "534",
        "山东农村商业银行" => "228",
        "山东农商银行" => "228",
        "山东农商" => "228",
        "福州农村商业银行" => "554",
        "福州农商银行" => "554",
        "福州农商" => "554",
        "湖州银行" => "527",
    ];

    /*   代收   */
    public function sendDeposit($data)
    {
        $this->key = $data['key'];
        $postBody = [
            "merchantCode" => $data["merchant"],
            'merchantOrderId' => $data['request']->order_number,
            "serviceId" => $data["key2"],
            'applyAmount' => strval($data['request']->amount),
            'callbackUrl' => $data['callback_url'],
        ];

        if (isset($data['request']->real_name) && $data['request']->real_name != '') {
            $postBody['applyUserName'] =  $data['request']->real_name;
        }

        try {
            $row = $this->sendRequest($data["url"], $postBody);
        } catch (\Throwable $th) {
            return ["success" => false, "msg" => $th->getMessage()];
        }

        if ($row["code"] == "00") {
            $info = $row["data"];
            $ret = [
                'order_number' => $data['request']->order_number,
                'amount' => $data['request']->amount,
                'pay_url'   => $info["paymentLink"] ?? '',
                'receiver_name' => $info["payeeName"] ?? "",
                'receiver_bank_name' => $info["payeeBankName"] ?? "",
                'receiver_account' => $info["payeeAccount"] ?? "",
                'receiver_bank_branch' => $info["payeeBranchName"] ?? "",
            ];
            return ['success' => true, 'data' => $ret];
        }

        return ["success" => false];
    }

    public function queryDeposit($data)
    {
        return ['success' => true, 'msg' => '原因'];
    }

    /*   代付   */
    public function sendDaifu($data)
    {
        $this->key = $data['key'];
        $bankCode = $this->bankMap[$this->normalizeChineseCharacters($data['request']->bank_name)] ?? null;
        if (!$bankCode) {
            return ['success' => false, 'msg' => '不支持此银行代付，请联系客服'];
        }

        $postBody = [
            "merchantCode" => $data["merchant"],
            'merchantOrderId' => $data['request']->order_number,
            "serviceId" => $data["key3"],
            'applyAmount' => strval($data['request']->amount),
            "applyUserName" => $data['request']->bank_card_holder_name,
            'applyAccount' => $data['request']->bank_card_number,
            'callbackUrl' => $data['callback_url'],
            'applyBankName' => $data["request"]->bank_name,
            'applyBankCode' => $bankCode,
        ];

        try {
            $result = $this->sendRequest($data["url"], $postBody);
        } catch (\Exception $e) {
            return ['success' => false];
        }

        if ($result["code"] == "00") {
            return ["success" => true];
        }
        return ["success" => false];
    }

    public function queryDaifu($data)
    {
        $this->key = $data['key'];

        $postBody = [
            "merchantCode" => $data["merchant"],
            'merchantOrderId' => $data['request']->order_number,
        ];

        try {
            $result = $this->sendRequest($data["url"], $postBody);
        } catch (\Exception $e) {
            return ['success' => false];
        }

        if ($result["code"] == "00") {
            return ["success" => true];
        }
        return ['success' => true, 'status' => Transaction::STATUS_PAYING];
    }

    /*   回调 => callback($request,订单资料)   */
    public function callback($request, Transaction $transaction, ThirdChannelModel $thirdChannel)
    {
        $data = $request->all();
        $sign = $this->makesign($data, $thirdChannel->key);

        if ($sign != $data["sign"]) {
            return ["error" => "签名不正确"];
        }

        if ($data["merchantOrderId"] != $transaction->order_number) {
            return ['error' => '订单编号不正确'];
        }

        if ($data["applyAmount"] != $transaction->amount) {
            return ['error' => '代收金额不正确'];
        }

        //代收检查状态
        if (in_array($data["status"], [2]) && in_array($transaction->type, [1])) {
            return ['success' => true];
        }

        //代付检查状态
        if (in_array($data["status"], [3]) && in_array($transaction->type, [4])) {
            return ['success' => true];
        }

        //代付检查状态，失败
        if (in_array($data["status"], [4])) {
            return ['fail' => '逾时'];
        }

        return ['error' => '未知错误'];
    }

    public function queryBalance($data)
    {
        $this->key = $data["key"];

        $postBody = [
            "merchantCode" => $data["merchant"],
        ];

        try {
            $row = $this->sendRequest($data["queryBalanceUrl"], $postBody);
            if ($row["code"] == "00") {
                $balance = $row["data"];
                ThirdChannelModel::where("id", $data["thirdchannelId"])->update([
                    "balance" => $balance,
                ]);
                return $balance;
            }
            return 0;
        } catch (\Throwable $th) {
            $message = $th->getMessage();
            Log::error(self::class, compact('data', 'message'));
            return 0;
        }
    }

    private function sendRequest($url, $data, $method = "POST", $debug = true)
    {
        $data["sign"] = $this->makesign($data, $this->key);
        try {
            $client = new Client();
            $response = $client->request($method, $url, [
                "json" => $data,
            ]);
            $row = json_decode($response->getBody(), true);
            if ($debug) {
                Log::debug(self::class, compact('data', 'row'));
            }
        } catch (RequestException $e) {
            $response = $e->getResponse();
            $message = json_decode($response->getBody()->getContents());
            $message = $message->message ?? "";
            Log::error(self::class, compact('data', 'message'));
            throw new Exception($message);
        }

        return json_decode($response->getBody(), true);
    }

    public function makesign($body, $key)
    {
        ksort($body);
        unset($body["sign"]);
        $signStr = urldecode(http_build_query($body) . "&key=$key");
        return strtoupper(md5($signStr));
    }
}
