<?php

namespace App\ThirdChannel;

use App\Model\Transaction;
use Illuminate\Http\Request;
use Illuminate\Support\Facades\Log;

class QXPay extends ThirdChannel
{
    //Log名称
    public $log_name   = 'QXPay';
    public $type    = 1; //1:代收付 2:纯代收 3:纯代付

    //回调地址
    public $notify    = '';
    public $depositUrl   = 'https://qxpay.xyz/pay/qrorder';
    public $xiafaUrl   = 'https://qxpay.xyz/payfor/trans';
    public $daifuUrl   = 'https://qxpay.xyz/payfor/trans';
    public $queryDepositUrl    = 'https://qxpay.xyz/pay/orderquery';
    public $queryDaifuUrl  = 'https://qxpay.xyz/payfor/orderquery';
    public $queryBalanceUrl = 'https://qxpay.xyz/pay/balancequery';

    //预设商户号
    public $merchant    = '';

    //预设密钥
    public $key          = '';
    public $key2         = '';

    //回传字串
    public $success = 'success';

    //白名单
    public $whiteIP = ['34.92.161.2'];

    public $channelCodeMap = [
        'ALIPAY_BANK' => '5',
        'BANK_CARD' => '8'
    ];

    public $bankMap = [
        '南阳村镇银行' => '1659',
        '潮州农商银行' => '1657',
        '蒙商银行' => '1656',
        '江苏农村银行' => '1655',
        '九银村镇银行' => '1654',
        '珠江村镇银行' => '1653',
        '泰隆村镇银行' => '1652',
        '邹平浦发村镇银行' => '1651',
        '青龙融兴村镇银行' => '1650',
        '广州白云民泰村镇银行' => '1649',
        '苏州农村商业银行' => '1648',
        '自贡银行' => '1646',
        '延吉和润村镇银行' => '1645',
        '图门敦银村镇银行' => '1644',
        '长春经开融丰村镇银行' => '1643',
        '长春绿园融泰村镇银行' => '1642',
        '龙井榆银村镇银行' => '1641',
        '长城华西银行' => '1640',
        '焦作中旅银行' => '1638',
        '广西柳江柳银村镇银行' => '1637',
        '兰州农村商业银行' => '1636',
        '四川银行' => '1635',
        '上栗富民村镇银行' => '1634',
        '泉州农商银行' => '1633',
        '龙海农商银行' => '1632',
        '深圳宝安桂银村镇银行股份有限公司' => '1631',
        '陕西信合' => '1630',
        '桂林国民村镇银行' => '1629',
        '福安农村信用合作联社' => '1628',
        '会昌农商银行' => '1625',
        '厦门农商银行' => '1624',
        '桂平桂银村镇银行' => '1556',
        '广东银行' => '1600',
        '辽阳农村商业银行股份有限公司' => '1557',
        '珠海市农村信用社' => '1552',
        '中旅银行' => '1551',
        '深圳发展银行' => '1550',
        '华一银行' => '1547',
        '华商银行' => '1546',
        '法国巴黎银行（中国）有限公司' => '1545',
        '荷兰合作银行有限公司' => '1544',
        '联合银行(中国)有限公司' => '1543',
        '摩根士丹利国际银行（中国）有限公司' => '1542',
        '澳大利亚和新西兰银行集团有限公司' => '1541',
        '加拿大蒙特利尔银行有限公司' => '1540',
        '加拿大丰业银行有限公司' => '1539',
        '瑞士银行' => '1538',
        '瑞士信贷银行股份有限公司' => '1537',
        '意大利联合圣保罗银行股份有限公司' => '1536',
        '德国北德意志州银行' => '1535',
        '德国巴伐利亚州银行' => '1534',
        '德国西德银行股份有限公司' => '1533',
        '德国商业银行股份有限公司' => '1532',
        '德意志银行（中国）有限公司' => '1531',
        '德国德累斯登银行股份公司' => '1530',
        '法国外贸银行股份有限公司' => '1529',
        '法国东方汇理银行股份有限公司' => '1528',
        '法国兴业银行（中国)有限公司' => '1527',
        '英国苏格兰皇家银行公众有限公司' => '1526',
        '渣打银行' => '1525',
        '荷兰安智银行股份有限公司' => '1524',
        '荷兰银行' => '1523',
        '比利时富通银行有限公司' => '1522',
        '比利时联合银行股份有限公司' => '1521',
        '奥地利中央合作银行股份有限公司' => '1520',
        '泰国盘谷银行(大众有限公司)' => '1519',
        '大华银行（中国）有限公司' => '1518',
        '华侨银行（中国）有限公司' => '1517',
        '韩亚银行（中国）有限公司' => '1516',
        '韩国中小企业银行' => '1515',
        '新韩银行(中国)有限公司' => '1514',
        '韩国产业银行' => '1513',
        '友利银行(中国)有限公司' => '1512',
        '外换银行（中国）有限公司' => '1511',
        '日本山口银行股份有限公司' => '1510',
        '瑞穗实业银行（中国）有限公司' => '1509',
        '日本三井住友银行股份有限公司' => '1508',
        '三菱东京日联银行(中国）有限公司' => '1507',
        '摩根大通银行(中国)有限公司' => '1506',
        '美国银行有限公司' => '1505',
        '花旗银行（中国）有限公司' => '1504',
        '永隆银行' => '1503',
        '永亨银行（中国）有限公司' => '1502',
        '星展银行（中国）有限公司' => '1501',
        '创兴银行有限公司' => '1500',
        '集友银行有限公司' => '1499',
        '中国银行（香港）有限公司' => '1498',
        '恒生银行(中国)有限公司' => '1497',
        '南洋商业银行' => '1496',
        '东亚银行' => '1495',
        '汇丰银行' => '1494',
        '长春农村商业发展银行' => '1493',
        '烟台农商银行' => '1492',
        '吉林公主岭农村商业银行' => '1491',
        '泰州农村商业银行' => '1490',
        '丰城顺银村镇银行' => '1489',
        '呼和浩特金谷农村商业银行股份有限公司' => '1488',
        '湖南三湘银行股份有限公司' => '1487',
        '四川天府银行股份有限公司' => '1486',
        '宁夏原州村镇银行有限责任公司' => '1485',
        '山东青隆村镇银行有限责任公司' => '1484',
        '中银富登村镇银行有限责任公司' => '1483',
        '长春和润村镇银行有限责任公司' => '1482',
        '河津市龙都村镇银行有限责任公司' => '1481',
        '和顺县贵都村镇银行有限责任公司' => '1480',
        '代县泓都村镇银行有限责任公司' => '1479',
        '汾阳市九都村镇银行有限责任公司' => '1478',
        '洪洞县洪都村镇银行有限责任公司' => '1477',
        '大同市南郊区京都村镇有限责任公司' => '1476',
        '交口县融都村镇银行有限责任公司' => '1475',
        '介休市华都村镇银行有限责任公司' => '1474',
        '临县泉都村镇银行有限责任公司' => '1473',
        '宁武县瑞都村镇银行有限责任公司' => '1472',
        '平定县昌都村镇银行有限责任公司' => '1471',
        '寿阳县汇都村镇银行有限责任公司' => '1470',
        '长治县泰都村镇银行有限责任公司' => '1469',
        '太原市尖草坪区信都村镇银行股份有限公司' => '1468',
        '文水县润都村镇银行有限责任公司' => '1467',
        '武乡县泽都村镇银行有限责任公司' => '1466',
        '忻州市忻府区秀都村镇银行有限责任公司' => '1465',
        '襄汾县万都村镇银行有限责任公司' => '1464',
        '阳高县兴都村镇银行有限责任公司' => '1463',
        '应县金都村镇银行有限责任公司' => '1462',
        '荥阳利丰村镇银行股份有限公司' => '1461',
        '浙江萧山湖商村镇银行股份有限公司' => '1460',
        '大连农村商业银行股份有限公司' => '1459',
        '内江兴隆村镇银行' => '1458',
        '安阳商都农商银行' => '1457',
        '中信百信银行' => '1456',
        '泸州纳溪农村信用合作联社' => '1455',
        '江苏南通农村商业银行' => '1454',
        '蓝海银行' => '1453',
        '山西阳曲农村商业银行' => '1452',
        '平阳农村商业银行' => '1451',
        '余杭农村商业银行' => '1450',
        '苏宁银行' => '1449',
        '梅州客商银行' => '1448',
        '贵阳小河科技村镇银行' => '1447',
        '江苏大丰农村商业银行' => '1446',
        '长沙农商银行' => '1445',
        '文水县农村信用合作联社' => '1444',
        '禾城农商银行' => '1443',
        '永济三禾村镇银行' => '1442',
        '内蒙古土默特右旗农村商业银行' => '1441',
        '湖南攸县农村商业银行股份有限公司' => '1440',
        '科尔沁左翼后旗农村信用合作联社博王信用社' => '1439',
        '贵州乌当农村商业银行' => '1438',
        '佛冈县农村信用合作联社' => '1437',
        '宁波余姚农村商业银行' => '1436',
        '湖北来凤农村商业银行' => '1435',
        '浦江农村商业银行' => '1434',
        '吉林九台农商银行' => '1433',
        '紫金农商银行' => '1432',
        '武汉众邦银行' => '1431',
        '达州银行股份有限公司' => '1430',
        '四川新网银行股份有限公司' => '1429',
        '宁波市北仑区农村信用合作联社' => '1428',
        '浙江瑞安农村商业银行股份有限公司' => '1427',
        '杭州联合银行' => '1426',
        '瓯海农村商业银行股份有限公司' => '1425',
        '浙江永康农村商业银行股份有限公司' => '1424',
        '浙江义乌农村商业银行股份有限公司' => '1423',
        '贵州兴仁农村商业银行' => '1422',
        '象山县农村信用合作联社' => '1421',
        '象山国民村镇银行' => '1420',
        '宜兴农村商业银行' => '1419',
        '江苏射阳农村商业银行' => '1418',
        '潍坊农村商业银行' => '1417',
        '石家庄汇融农村合作银行' => '1416',
        '扬州农村商业银行' => '1415',
        '浙江新昌农村商业银行' => '1414',
        '重庆富民银行' => '1413',
        '新华村镇银行' => '1412',
        '安徽东至农村商业银行' => '1411',
        '敦化农村商业银行' => '1410',
        '太原市城区农村信用合作联社' => '1409',
        '山西长治市武乡县农村信用合作联社' => '1408',
        '山西长治市屯留县农村信用合作联社' => '1407',
        '山西长治市沁源县农村信用合作联社' => '1406',
        '山西长治市沁县农村信用合作联社' => '1405',
        '山西长治市平顺县农村信用合作联社' => '1404',
        '山西长治市黎城县农村信用合作联社' => '1403',
        '山西晋中市榆社县农村信用合作联社' => '1402',
        '山西大同市大同县农村信用合作联社' => '1401',
        '山西长治壶关农村商业银行' => '1400',
        '浙江网商银行' => '1399',
        '上海华瑞银行' => '1398',
        '石河子国民村镇银行' => '1397',
        '奎屯国民村镇银行' => '1396',
        '伊犁国民村镇银行' => '1395',
        '昌吉国民村镇银行' => '1394',
        '哈密红星国民村镇银行' => '1393',
        '克拉玛依金龙国民村镇银行' => '1392',
        '新疆绿洲国民村镇银行' => '1391',
        '东兴国民村镇银行' => '1390',
        '防城港防城国民村镇银行' => '1389',
        '广西浦北国民村镇银行' => '1388',
        '广西钦州市钦南国民村镇银行' => '1387',
        '广西银海国民村镇银行' => '1386',
        '广西上林国民村镇银行' => '1385',
        '东营莱商村镇银行' => '1384',
        '海口联合农村商业银行' => '1383',
        '新疆汇和银行' => '1382',
        '哈密市商业银行' => '1381',
        '石嘴山银行' => '1380',
        '西藏银行' => '1379',
        '海南银行' => '1378',
        '浙江德清农村商业银行' => '1377',
        '桓仁满族自治县农村信用联社' => '1376',
        '本溪满族自治县农村信用合作联社' => '1375',
        '绥中县农村信用合作联社' => '1374',
        '建平县农村信用合作联社' => '1373',
        '朝阳县农村信用合作联社' => '1372',
        '辽宁沈抚农村商业银行' => '1371',
        '抚顺县农村信用合作联社' => '1370',
        '沈阳农商银行' => '1369',
        '凤城农村商业银行' => '1368',
        '东港市农村信用合作联社' => '1367',
        '辽宁东港农村商业银行' => '1366',
        '亳州药都农村商业银行' => '1365',
        '吉林环城农村商业银行' => '1364',
        '深圳南山宝生村镇银行' => '1362',
        '栾川民丰村镇银行' => '1361',
        '孟津民丰村镇银行' => '1360',
        '南阳市农村信用社' => '1359',
        '河南省农村信用社' => '1358',
        '晋城农村商业银行' => '1357',
        '泰安泰山农村商业银行' => '1356',
        '湘乡市村镇银行' => '1355',
        '长沙雨花农村合作银行' => '1354',
        '湖南湘乡农村商业银行' => '1353',
        '宁阳沪农商村镇银行' => '1352',
        '浙江龙湾农村商业银行' => '1351',
        '浙江乐清农村商业银行' => '1350',
        '沈阳农村商业银行' => '1349',
        '安徽天长农村商业银行' => '1348',
        '山西介休农村商业银行' => '1347',
        '山西襄垣农村商业银行' => '1346',
        '山西忻州农村商业银行' => '1345',
        '山西长治黎都农村商业银行' => '1344',
        '山西清徐农村商业银行' => '1343',
        '山西运城农村商业银行' => '1342',
        '山西古交农村商业银行' => '1341',
        '山西潞城农村商业银行' => '1340',
        '山西河津农村商业银行' => '1339',
        '山西盂县农村商业银行' => '1338',
        '山西榆次农村商业银行' => '1337',
        '山西侯马农村商业银行' => '1336',
        '山西寿阳农村商业银行' => '1335',
        '山西乡宁农村商业银行' => '1334',
        '山西五台农村商业银行' => '1333',
        '山西灵石农村商业银行' => '1332',
        '长治潞州农村商业银行' => '1331',
        '大同北都农村商业银行' => '1330',
        '威海农村商业银行' => '1329',
        '湘潭农村商业银行' => '1328',
        '湖南星沙农村商业银行' => '1327',
        '湖南浏阳农村商业银行' => '1326',
        '长治市郊区农村信用合作联社' => '1325',
        '青岛农村商业银行' => '1324',
        '肇庆端州农村商业银行' => '1323',
        '长治漳泽农村商业银行' => '1322',
        '湖北沙洋农村商业银行' => '1321',
        '鄂尔多斯农村商业银行' => '1320',
        '林州市农村信用合作联社' => '1319',
        '河南伊川农村商业银行' => '1318',
        '偃师市农村信用合作社联合社' => '1317',
        '玉田县农村信用合作社联合社' => '1316',
        '驻马店银行' => '1315',
        '山西平遥农村商业银行' => '1314',
        '河南辉县农村商业银行' => '1313',
        '洛阳市市区农村信用合作社联合社' => '1312',
        '衢州市柯城农村信用合作联社' => '1311',
        '河南鄢陵农村商业银行' => '1310',
        '河南济源农村商业银行' => '1309',
        '封丘县农村信用合作社联合社' => '1308',
        '焦作市解放区农村信用合作社联合社' => '1307',
        '郑州市市郊农村信用合作联社' => '1306',
        '新安县农村信用合作社联合社' => '1305',
        '洛阳市经贸开发区农村信用合作联社' => '1304',
        '洛阳市西工区农村信用合作联社' => '1303',
        '天津金城银行' => '1302',
        '贵州花溪农村商业银行' => '1301',
        '广东河源农村商业银行' => '1300',
        '遵义市汇川区农村信用合作联社' => '1299',
        '云南红塔农村合作银行' => '1298',
        '瓮安农村商业银行' => '1297',
        '湖北十堰农村商业银行' => '1296',
        '安顺市西秀区农村信用社联合社' => '1295',
        '三都县农村信用社' => '1294',
        '贵州湄潭农村商业银行' => '1293',
        '开平市农村信用合作联社' => '1292',
        '文山市农村信用合作联社' => '1291',
        '威宁县农村信用合作联社' => '1290',
        '贵州福泉农村商业银行' => '1289',
        '梅县农村信用合作联社' => '1288',
        '贵州都匀农村商业银行' => '1287',
        '贵州兴义农村商业银行' => '1286',
        '贵州织金农村商业银行' => '1285',
        '贵州惠水农村商业银行' => '1284',
        '水城县农村信用合作联社' => '1283',
        '大理市农村合作银行' => '1282',
        '广东高明农村商业银行' => '1281',
        '宣威市农村信用合作社' => '1280',
        '安顺市农村商业银行' => '1279',
        '榕江县农村信用合作社' => '1278',
        '清镇市农村信用合作社' => '1277',
        '贵阳农村商业银行' => '1276',
        '鹤山市农村信用合作社' => '1275',
        '台山市农村信用合作社' => '1274',
        '江门融和农村商业银行' => '1273',
        '新疆农村信用社' => '1272',
        '黑龙江省农村信用社联合社' => '1271',
        '山西泽州农村商业银行' => '1270',
        '西宁农村商业银行' => '1269',
        '延边农村商业银行' => '1268',
        '信阳银行' => '1267',
        '铁岭商业银行' => '1266',
        '四川省农村信用合作社' => '1265',
        '青海省农村信用社联合社' => '1264',
        '平顶山银行' => '1263',
        '宁波东海银行' => '1262',
        '江南农村商业银行' => '1261',
        '朝阳银行' => '1260',
        '长治银行' => '1259',
        '贵州银行' => '1258',
        '山西长子农村商业银行' => '1257',
        '颍淮农村商业银行' => '1256',
        '珲春农村商业银行' => '1255',
        '重庆渝北银座村镇银行' => '1254',
        '遵义市商业银行' => '1253',
        '周口市商业银行' => '1252',
        '云南红塔银行' => '1251',
        '宜宾市商业银行' => '1250',
        '阳泉市商业银行' => '1249',
        '雅安市商业银行' => '1248',
        '许昌银行' => '1247',
        '象山县绿叶城市信用社' => '1246',
        '乌海银行' => '1245',
        '天津滨海农村商业银行' => '1244',
        '唐山市商业银行' => '1243',
        '遂宁市商业银行' => '1242',
        '山西省农村信用社' => '1241',
        '内蒙古农村信用社' => '1240',
        '凉山州商业银行' => '1239',
        '乐山市商业银行' => '1238',
        '库尔勒市商业银行' => '1237',
        '晋中市商业银行' => '1236',
        '衡水市商业银行' => '1235',
        '鹤壁银行' => '1234',
        '河北省农村信用社联合社' => '1233',
        '广东农村信用社' => '1232',
        '保定银行' => '1231',
        '安阳市商业银行' => '1230',
        '安顺市商业银行' => '1229',
        '宁夏黄河农村商业银行' => '1228',
        '云南省农村信用社联合社' => '1227',
        '海南省农村信用社联合社' => '1226',
        '广西壮族自治区农村信用社联合社' => '1225',
        '南阳银行' => '1224',
        '商丘市商业银行' => '1223',
        '漯河市商业银行' => '1222',
        '开封市商业银行' => '1221',
        '泰安市商业银行' => '1220',
        '东营银行' => '1219',
        '晋城市商业银行' => '1218',
        '陕西省农村信用社联合社' => '1217',
        '淄博市商业银行' => '1216',
        '甘肃省农村信用社联合社' => '1215',
        '江西农商银行' => '1214',
        '湖南省农村信用社联合社' => '1213',
        '无锡农村商业银行' => '1212',
        '贵州省农村信用社联合社' => '1211',
        '临汾市尧都市农村信用合作社联合社' => '1210',
        '太仓农村商业银行' => '1209',
        '中山农村商业银行' => '1208',
        '珠海农商银行' => '1207',
        '江苏东吴农村商业银行' => '1206',
        '浙江省农村信用社联合社' => '1205',
        '佛山农村商业银行' => '1204',
        '高要市农村信用合作社联合社' => '1203',
        '江门市新会农村信用合作社联合社' => '1202',
        '江苏省农村信用合作社联合社' => '1201',
        '沧州市农村信用合作社联合社' => '1200',
        '成都市农村信用合作社联合社' => '1199',
        '佛山市三水区农村信用合作社联合社' => '1198',
        '宁波鄞州农村合作银行' => '1197',
        '天津农商银行' => '1196',
        '山东省农村信用社联合社' => '1194',
        '江苏江阴农村商业银行' => '1193',
        '徐州市市郊农村信用合作社联合社' => '1192',
        '湖北省农村信用社联合社' => '1191',
        '昆明市农村信用合作社联合社' => '1190',
        '广东南海农村商业银行' => '1188',
        '浙江萧山农村商业银行' => '1187',
        '江苏常熟农村商业银行' => '1186',
        '曲靖市商业银行' => '1185',
        '六盘水市商业银行' => '1184',
        '新疆银行' => '1183',
        '江苏长江商业银行' => '1182',
        '张家口市商业银行' => '1181',
        '三门峡银行' => '1180',
        '大同市商业银行' => '1179',
        '泸州银行' => '1178',
        '包商银行' => '1177',
        '嘉兴银行' => '1176',
        '阜新银行' => '1175',
        '秦皇岛市商业银行' => '1174',
        '鞍山银行' => '1173',
        '日照银行' => '1172',
        '江西银行' => '1171',
        '丹东银行' => '1170',
        '重庆银行' => '1169',
        '抚顺银行' => '1168',
        '金华银行' => '1167',
        '辽阳银行' => '1166',
        '盛京银行' => '1165',
        '甘肃银行' => '1164',
        '焦作市商业银行' => '1163',
        '福州银行' => '1162',
        '重庆三峡银行' => '1161',
        '华融湘江银行' => '1160',
        '中国农业发展银行' => '1159',
        '国家开发银行' => '1158',
        '南京银行' => '1156',
        '天津农村商业银行' => '1155',
        '江苏农业商业银行' => '1154',
        '安徽省农村信用社联合社' => '1153',
        '河北省农村信用社' => '1152',
        '武汉农村商业银行' => '1150',
        '自贡市商业银行' => '1149',
        '珠海华润银行' => '1148',
        '中原银行' => '1147',
        '郑州银行' => '1146',
        '浙商银行' => '1145',
        '浙江三门银座村镇银行' => '1144',
        '浙江民泰商业银行' => '1143',
        '浙江景宁银座村镇银行' => '1142',
        '浙江稠州商业银行' => '1141',
        '张家港农村商业银行' => '1140',
        '枣庄银行' => '1139',
        '友利银行' => '1138',
        '营口银行' => '1137',
        '鄞州银行' => '1136',
        '烟台银行' => '1135',
        '邢台银行' => '1134',
        '新韩银行中国' => '1133',
        '西安银行' => '1132',
        '吴江农村商业银行' => '1131',
        '乌鲁木齐市商业银行' => '1130',
        '温州银行' => '1129',
        '潍坊银行' => '1128',
        '威海市商业银行' => '1127',
        '天津银行' => '1126',
        '顺德农村商业银行' => '1125',
        '台州银行' => '1124',
        '厦门国际银行' => '1123',
        '苏州银行' => '1122',
        '深圳前海微众银行' => '1121',
        '深圳福田银座村镇银行' => '1120',
        '绍兴银行' => '1119',
        '上饶银行' => '1118',
        '山东省农联社' => '1117',
        '泉州银行' => '1116',
        '青海银行' => '1115',
        '青岛银行' => '1114',
        '企业银行' => '1113',
        '齐商银行' => '1112',
        '齐鲁银行' => '1111',
        '攀枝花市商业银行' => '1110',
        '宁夏银行' => '1109',
        '宁波通商银行' => '1108',
        '内蒙古银行' => '1107',
        '南昌银行' => '1106',
        '绵阳市商业银行' => '1105',
        '洛阳银行' => '1104',
        '龙江银行' => '1103',
        '临商银行' => '1102',
        '廊坊银行' => '1101',
        '莱商银行' => '1100',
        '昆山农村商业银行' => '1099',
        '昆仑银行' => '1098',
        '九江银行' => '1097',
        '晋商银行' => '1096',
        '锦州银行' => '1095',
        '江阴农村商业银行' => '1094',
        '江西赣州银座村镇银行' => '1093',
        '江苏长江商行' => '1092',
        '济宁银行' => '1091',
        '吉林银行' => '1090',
        '徽商银行' => '1089',
        '黄河农村商业银行' => '1088',
        '葫芦岛银行' => '1087',
        '湖州银行' => '1086',
        '湖北银行' => '1085',
        '湖北农信' => '1084',
        '恒丰银行' => '1083',
        '杭州银行' => '1082',
        '汉口银行' => '1081',
        '韩亚银行' => '1080',
        '邯郸市商业银行' => '1079',
        '哈尔滨银行' => '1078',
        '贵阳银行' => '1077',
        '广州农村商业银行' => '1076',
        '广西农村信用社' => '1075',
        '广东华兴银行' => '1074',
        '赣州银行' => '1073',
        '富滇银行' => '1072',
        '阜新银行结算中心' => '1071',
        '福建海峡银行' => '1070',
        '鄂尔多斯银行' => '1069',
        '东亚银行（中国）有限公司' => '1068',
        '德州银行' => '1067',
        '德阳银行' => '1066',
        '大连银行' => '1065',
        '重渝庆北银座村镇银行' => '1064',
        '重庆银行股份有限公司' => '1063',
        '承德银行' => '1062',
        '常熟农村商业银行' => '1061',
        '长沙银行' => '1060',
        '长安银行' => '1059',
        '沧州银行' => '1058',
        '北京顺义银座村镇银行' => '1057',
        '渤海银行' => '1056',
        '包商银行股份有限公司' => '1055',
        '鞍山市商业银行' => '1054',
        '安徽省农村信用社' => '1053',
        '成都农村商业银行' => '1052',
        '广东南粤银行' => '1051',
        '南充市商业银行' => '1050',
        '浙江泰隆商业银行' => '1049',
        '四川省农村信用社' => '1048',
        '东莞银行' => '1047',
        '辽宁省农村信用社' => '1046',
        '贵州省农村信用社' => '1045',
        '成都银行' => '1043',
        '吉林省农村信用社' => '1042',
        '广东省农村信用社' => '1041',
        '海南省农村信用社' => '1040',
        '福建省农村信用社' => '1039',
        '厦门银行' => '1038',
        '北京农村商业银行' => '1037',
        '广州银行' => '1036',
        '深圳农村商业银行' => '1035',
        '重庆黔江银座村镇银行' => '1034',
        '上海农村商业银行' => '1033',
        '浙江省农村信用社' => '1032',
        '湖北省农村信用社' => '1031',
        '云南省农村信用社' => '1030',
        '江苏省农村信用社' => '1029',
        '农村信用社' => '1028',
        '柳州银行' => '1027',
        '广西北部湾银行' => '1026',
        '兰州银行' => '1025',
        '河北银行' => '1024',
        '江苏银行' => '1023',
        '桂林银行' => '1022',
        '重庆农村商业银行' => '1021',
        '贵阳市商业银行' => '1020',
        '宁波银行' => '1019',
        '东莞农村商业银行' => '1018',
        '上海银行' => '1017',
        '北京银行' => '1016',
        '华夏银行' => '1015',
        '广发银行' => '1014',
        '光大银行' => '1013',
        '民生银行' => '1012',
        '中信银行' => '1011',
        '兴业银行' => '1010',
        '中国邮政储蓄银行' => '1009',
        '交通银行' => '1008',
        '浦发银行' => '1007',
        '建设银行' => '1006',
        '中国银行' => '1005',
        '招商银行' => '1004',
        '农业银行' => '1003',
        '平安银行' => '1002',
        '工商银行' => '1001'
    ];

    /*   代收   */
    public function sendDeposit($data)
    {
        $this->key = $data['key'];

        $postHeaders = [
            'sid' => $data['merchant'] ?? $this->merchant,
            'timestamp' => explode('.', round(microtime(true) * 1000))[0],
            'nonce' => uniqid(),
            'url' => '/pay/qrorder',
        ];

        $postBody = [
            'out_trade_no' => $data['request']->order_number,
            'channel' => $this->channelCodeMap[$this->channelCode],
            'amount' => number_format($data['request']->amount, 2, '.', ''),
            'currency' => 'CNY',
            'notify_url' => $data['callback_url'],
            'return_url' => '',
            'send_ip' => $data['request']->client_ip ?? $data['client_ip'],
            'attach' => ''
        ];

        $sign = $this->makesign($postHeaders, $postBody, $this->key);

        $postHeaders['sign'] = $sign;
        $postHeaders['Content-Type'] = 'application/x-www-form-urlencoded';

        try {
            $client = new \GuzzleHttp\Client();
            $response = $client->request('POST', $data['url'], [
                'headers' => $postHeaders,
                'form_params' => $postBody
            ]);
            $row = json_decode($response->getBody(), true);
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'postHeaders', 'postBody', 'message'));
            return ['success' => false];
        }

        Log::debug(self::class, compact('data', 'postHeaders', 'postBody', 'row'));

        if (isset($row['code']) && in_array($row['code'], ['1000'])) {
            $payInfo = json_decode($row['pay_url'], true);
            $ret = [
                'order_number' => $data['request']->order_number,
                'amount' => $data['request']->amount,
                'receiver_name' => $payInfo['pay_json']['account_name'],
                'receiver_bank_name' => $payInfo['pay_json']['bank_name'],
                'receiver_account' => $payInfo['pay_json']['card_number'],
                'receiver_bank_branch' => $payInfo['pay_json']['sub_bank'],
                'pay_url'   => $payInfo['pay_url'] ?? '',
                'created_at' => date('Y-m-d H:i:s'),
            ];
            return ['success' => true, 'data' => $ret];
        } else {
            return ['success' => false];
        }
    }

    public function queryDeposit($data)
    {
        return ['success' => true,'msg' => '原因'];
    }

    /*   代付   */
    public function sendDaifu($data)
    {
        $this->key = $data['key'];

        $postHeaders = [
            'sid' => $data['merchant'] ?? $this->merchant,
            'timestamp' => explode('.', round(microtime(true) * 1000))[0],
            'nonce' => uniqid(),
            'url' => '/payfor/trans',
        ];

        if (!isset($this->bankMap[$data['request']->bank_name])) {
            return ['success' => false, 'msg' => '不支持此银行代付，请联系客服'];
        }

        $postBody = [
            'out_trade_no' => $data['request']->order_number,
            'amount' => number_format($data['request']->amount, 2, '.', ''),
            'bank_name' => $this->bankMap[$data['request']->bank_name],
            'bank_province' => '',
            'bank_city' => '',
            'sub_bank' => $data['request']->bank_name,
            'card_no' => $data['request']->bank_card_number,
            'bank_account' => $data['request']->bank_card_holder_name,
            'notify_url' => $data['callback_url'],
            'currency' => 'CNY',
            'send_ip' => request()->ip(),
            'attach' => ''
        ];

        $sign = $this->makesign($postHeaders, $postBody, $this->key);

        $postHeaders['sign'] = $sign;
        $postHeaders['Content-Type'] = 'application/x-www-form-urlencoded';

        try {
            $client = new \GuzzleHttp\Client();
            $response = $client->request('POST', $data['url'], [
                'headers' => $postHeaders,
                'form_params' => $postBody
            ]);
            $row = json_decode($response->getBody(), true);
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'postHeaders', 'postBody', 'message'));
            return ['success' => true];
        }

        Log::debug(self::class, compact('data', 'postHeaders', 'postBody', 'row'));

        if (isset($row['code']) && in_array($row['code'],['1000'])) {
            return ['success' => true];
        }

        return ['success' => false];
    }

    public function queryDaifu($data)
    {
        $this->key = $data['key'];

        $postHeaders = [
            'sid' => $data['merchant'] ?? $this->merchant,
            'timestamp' => explode('.', round(microtime(true) * 1000))[0],
            'nonce' => uniqid(),
            'url' => '/payfor/orderquery',
        ];

        $postBody = [
            'out_trade_no' => $data['request']->order_number,
            'amount' => number_format($data['request']->amount, 2, '.', ''),
        ];

        $sign = $this->makesign($postHeaders, $postBody, $this->key);

        $postHeaders['sign'] = $sign;
        $postHeaders['Content-Type'] = 'application/x-www-form-urlencoded';

        try {
            $client = new \GuzzleHttp\Client();
            $response = $client->request('POST', $data['queryDaifuUrl'], [
                'headers' => $postHeaders,
                'form_params' => $postBody
            ]);
            $row = json_decode($response->getBody(), true);
        } catch (\Exception $e) {
            $message = $e->getMessage();
            Log::error(self::class, compact('data', 'postHeaders', 'postBody', 'message'));
            return ['success' => false, 'status' => Transaction::STATUS_PAYING];
        }

        Log::debug(self::class, compact('data', 'postHeaders', 'postBody', 'response'));

        if (isset($row['code']) && in_array($row['code'],['1000'])) {
            return ['success' => true, 'status' => Transaction::STATUS_PAYING];
        }

        return ['success' => false, 'status' => Transaction::STATUS_PAYING];
    }

    /*   回调 => callback($request,訂單資料)   */
    public function callback($request, $transaction)
    {
        $data = $request->all();

        if ($data['out_trade_no'] != $transaction->order_number) {
            return ['error' => '订单编号不正确'];
        }

        //代收檢查金額
        if (isset($data['pay_amount']) && $data['pay_amount'] != $transaction->amount) {
            return ['error' => '代收金额不正确'];
        }

        //代付檢查金額
        if (isset($data['amount']) && $data['amount'] != $transaction->amount) {
            return ['error' => '代付金额不正确'];
        }

        //代收檢查狀態
        if (isset($data['code']) && in_array($data['code'], ['1000'])) {
            return ['success' => true];
        }

        //代付檢查狀態，失敗
        if (isset($data['code']) && !in_array($data['code'], ['1000'])) {
            return ['fail' => '逾時'];
        }

        return ['error' => '未知错误'];
    }

    public function queryBalance($data)
    {
        return 99999999;
    }

    public function makesign($header, $body, $key)
    {
        ksort($header);
        ksort($body);

        $header = str_replace(['=','&'], '', http_build_query($header));
        $body = str_replace(['=','&'], '', http_build_query($body));

        $strSign = $header . $body . $key;

        return strtoupper(hash('md5', urldecode($strSign)));
    }
}
